
&НаСервереБезКонтекста
Процедура ВыгрузитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтудентыБГЭУ.Ссылка КАК Ссылка,
	               |	СтудентыБГЭУ.Наименование КАК Наименование,
	               |	СтудентыБГЭУ.Статус КАК Статус
	               |ИЗ
	               |	Справочник.СтудентыБГЭУ КАК СтудентыБГЭУ";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	
	Файл = Новый ЗаписьТекста("C:\Статусы\Исходник.csv");
	Для Каждого СТЗ Из ТЗ Цикл	
		Файл.ЗаписатьСтроку(XMLСтрока(СТЗ.Ссылка) + ";" + СТЗ.Наименование + ";" + СТЗ.Статус);
	КонецЦикла;
	Файл.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
	Сообщить("Готово");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервере()
	Файл = Новый ЗаписьТекста("C:\Статусы\Проблемы.txt");
	
	Текст = Новый ЧтениеТекста;
	Текст.Открыть("C:\Статусы\СтатусыДляЗагрузки.csv");              

	Строка = Текст.ПрочитатьСтроку();
	Пока Строка <> Неопределено Цикл
		Данные = СтрРазделить(Строка, ";", Истина);
		Попытка
			Студент = XMLЗначение(Тип("СправочникСсылка.СтудентыБГЭУ"), Данные[0]).ПолучитьОбъект();	
			Если Данные[2] = "Обучается" Тогда
				Студент.Статус = Перечисления.СтатусСтудента.Обучается;
			ИначеЕсли Данные[2] = "Академ. отпуск" Тогда
				Студент.Статус = Перечисления.СтатусСтудента.АкадемОтпуск;
			ИначеЕсли Данные[2] = "Отчислен" Тогда
				Студент.Статус = Перечисления.СтатусСтудента.Отчислен;
			ИначеЕсли Данные[2] = "Выпускник" Тогда
				Студент.Статус = Перечисления.СтатусСтудента.Выпускник;
			Иначе
				Файл.ЗаписатьСтроку("Статус не найден;" + Данные[1] + ";" + Данные[2]);
			КонецЕсли
		Исключение
			Файл.ЗаписатьСтроку("Не найден;" + Данные[1]);
			Строка = Текст.ПрочитатьСтроку();
			Продолжить;
		КонецПопытки;
		Студент.Записать();
		Строка = Текст.ПрочитатьСтроку();
	КонецЦикла;
	Файл.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
	Сообщить("Готово");
КонецПроцедуры
