
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЗаполнитьТЧДанными()
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧДанными()
	МассивСемНед = Новый Массив;
	Для Каждого Стр из СеместрыНедели Цикл
		МассивСемНед.Добавить(Стр.ЧислоНедель);
	КонецЦикла;
	Закрыть(МассивСемНед);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Семестр = 1;
	Для Каждого НеделиПоСему Из Параметры.Семестры Цикл
		Стр = СеместрыНедели.Добавить();
		Стр.Семестр = Семестр;
		Стр.ЧислоНедель = НеделиПоСему;
		Семестр = Семестр + 1
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ЗаполнитьТЧДанными()
КонецПроцедуры
