&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ТекущийОбъект.Пол) Тогда
		Пол = ?(ТекущийОбъект.Пол = Перечисления.Пол.Мужской, "ПЛ=Мужской", "ПЛ=Женский");
	Иначе
		Пол = "";
	КонецЕсли;
	
	ФИО = ОбщиеФункции.СжПробелы(ТекущийОбъект.Фамилия + " " + ТекущийОбъект.Имя + " " + ТекущийОбъект.Отчество);
	ТекущийОбъект.ФИОРод = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Родительный")[0];
	ТекущийОбъект.ФИОДат = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Дательный")[0];
	ТекущийОбъект.ФИОВин = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Винительный")[0];
	ТекущийОбъект.ФИОТвор = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Творительный")[0];
	ТекущийОбъект.ФИОПредл = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Предложный")[0];
КонецПроцедуры