
&НаКлиенте
Процедура ПросколнятьСтудентов(Команда)
	ПросколнятьСтудентовНаСервере();
	Сообщить("Готово");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПросколнятьСтудентовНаСервере()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтудентыБГЭУ.Ссылка КАК Ссылка,
	               |	СтудентыБГЭУ.Представление КАК Представление
	               |ИЗ
	               |	Справочник.СтудентыБГЭУ КАК СтудентыБГЭУ";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СТЗ Из ТЗ Цикл
		Студент = СТЗ.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(Студент.Пол) Тогда
			Пол = ?(Студент.Пол = Перечисления.Пол.Мужской, "ПЛ=Мужской", "ПЛ=Женский");
		Иначе
			Пол = "";
		КонецЕсли;

		ФИО = ОбщиеФункции.СжПробелы(Студент.Фамилия + " " + Студент.Имя + " " + Студент.Отчество);
		Студент.ФИОРод = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Родительный")[0];
		Студент.ФИОДат = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Дательный")[0];
		Студент.ФИОВин = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Винительный")[0];
		Студент.ФИОТвор = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Творительный")[0];
		Студент.ФИОПредл = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Предложный")[0];	
		Студент.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПросклонятьСотрудников(Команда)
	ПросклонятьСотрудниковНаСервере();
	Сообщить("Готово");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПросклонятьСотрудниковНаСервере()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Ссылка КАК Ссылка,
	               |	Сотрудники.Представление КАК Представление
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СТЗ Из ТЗ Цикл
		Сотрудник = СТЗ.Ссылка.ПолучитьОбъект();
		Если ЗначениеЗаполнено(Сотрудник.Пол) Тогда
			Пол = ?(Сотрудник.Пол = Перечисления.Пол.Мужской, "ПЛ=Мужской", "ПЛ=Женский");
		Иначе
			Пол = "";
		КонецЕсли;
		ФИО = ОбщиеФункции.СжПробелы(Сотрудник.Фамилия + " " + Сотрудник.Имя + " " + Сотрудник.Отчество);
		Сотрудник.ФИОРодительныйПадеж = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Родительный")[0];
		Сотрудник.ФИОДательныйПадеж = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Дательный")[0];
		Сотрудник.ФИОВинительныйПадеж = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Винительный")[0];
		Сотрудник.ФИОТворительныйПадеж = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Творительный")[0];
		Сотрудник.ФИОПредложныйПадеж = ПолучитьСклоненияСтроки(ФИО, Пол, "ПД=Предложный")[0];	
		Сотрудник.Записать();
	КонецЦикла;
КонецПроцедуры