//Удалёем лишние символы в наименовании элементов справочника Контингент (там номера планов хранятся)

&НаСервереБезКонтекста
Процедура УдалитьЛишниеСимволыВПланахНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контингент.Ссылка,
	               |	Контингент.Представление,
	               |	Контингент.Наименование
	               |ИЗ
	               |	Справочник.Контингент КАК Контингент
	               |ГДЕ
	               |	Контингент.ЭтоГруппа = ЛОЖЬ
	               |	И (Контингент.Родитель.Наименование = ""ВечерняяИИТ""
	               |			ИЛИ Контингент.Родитель.Наименование = ""ДистанционнаяФО""
	               |			ИЛИ Контингент.Родитель.Наименование = ""ДневнаяФО""
	               |			ИЛИ Контингент.Родитель.Наименование = ""ЗаочнаяИИТ""
	               |			ИЛИ Контингент.Родитель.Наименование = ""ЗаочнаяФО""
	               |			ИЛИ Контингент.Родитель.Наименование = ""ИностранныеГраждане""
	               |			ИЛИ Контингент.Родитель.Наименование = ""Магистратура"")";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.IgnoreCase = Ложь;
	RegExp.Global = Истина;
	RegExp.MultiLine = Ложь;
	RegExp.Pattern = "[^А-Яа-я-_0-9.\/\n]";
	
	Для Каждого СТЗ Из ТЗ Цикл
		Если RegExp.Test(СТЗ.Наименование) Тогда
			оКонтингент = СТЗ.Ссылка.ПолучитьОбъект();
			оКонтингент.Наименование = RegExp.Replace(СТЗ.Наименование, "");
			оКонтингент.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЛишниеСимволыВПланах(Команда)
	УдалитьЛишниеСимволыВПланахНаСервере()	
КонецПроцедуры
