
&НаКлиенте
Процедура ВыгрузитьДисциплины(Команда)
	СформироватьДокументСДисциплинамиПоВыбору(Путь);
	Сообщить("Документ сформирован");
КонецПроцедуры

&НаКлиенте
Процедура ПровестиВсеДокументы(Команда)
	ПерепровестиПланыДФО();
	ПерепровестиПланыЗФО();
	ПерепровестиИИТВФО();
	ПерепровестиИИТЗФО();
	ПерепровестиУчебныйПланМагистратураДО();
	ПерепровестиУчебныйПланМагистратураЗО();
	ПерепровестиУчебныйПланМагистратураИнГраждане();
	Сообщить("Готово");
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПерепровестиПланыДФО()
	Запрос = Новый Запрос();
	Запрос.Текст =  "ВЫБРАТЬ
	                |	УчебныйПланДФО.Ссылка,
	                |	УчебныйПланДФО.ГодВыпуска
	                |ИЗ
	                |	Документ.УчебныйПланДФО КАК УчебныйПланДФО
	                |ГДЕ
	                |	УчебныйПланДФО.ГодВыпуска <> ""2022"" И УчебныйПланДФО.ГодВыпуска <> ""2021""";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СТЗ Из ТЗ Цикл
		УчПлан = СТЗ.Ссылка.ПолучитьОбъект();		
		УчПлан.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерепровестиПланыЗФО()
	Запрос = Новый Запрос();
	Запрос.Текст =  "ВЫБРАТЬ
	                |	УчебныйПланЗФО.Ссылка,
	                |	УчебныйПланЗФО.ГодВыпуска
	                |ИЗ
	                |	Документ.УчебныйПланЗФО КАК УчебныйПланЗФО
	                |ГДЕ
	                |	УчебныйПланЗФО.ГодВыпуска <> ""2022""
	                |	И УчебныйПланЗФО.ГодВыпуска <> ""2021""";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СТЗ Из ТЗ Цикл
		УчПлан = СТЗ.Ссылка.ПолучитьОбъект();		
		УчПлан.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерепровестиИИТВФО()
	Запрос = Новый Запрос();
	Запрос.Текст =  "ВЫБРАТЬ
	                |	УчебныйПланИИТВФО.Ссылка,
	                |	УчебныйПланИИТВФО.ГодВыпуска
	                |ИЗ
	                |	Документ.УчебныйПланИИТВФО КАК УчебныйПланИИТВФО
	                |ГДЕ
	                |	УчебныйПланИИТВФО.ГодВыпуска <> ""2022""
	                |	И УчебныйПланИИТВФО.ГодВыпуска <> ""2021""";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СТЗ Из ТЗ Цикл
		УчПлан = СТЗ.Ссылка.ПолучитьОбъект();		
		УчПлан.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерепровестиИИТЗФО()
	Запрос = Новый Запрос();
	Запрос.Текст =  "ВЫБРАТЬ
	                |	УчебныйПланИИТЗФО.Ссылка,
	                |	УчебныйПланИИТЗФО.ГодВыпуска
	                |ИЗ
	                |	Документ.УчебныйПланИИТЗФО КАК УчебныйПланИИТЗФО
	                |ГДЕ
	                |	УчебныйПланИИТЗФО.ГодВыпуска <> ""2022""
	                |	И УчебныйПланИИТЗФО.ГодВыпуска <> ""2021""";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СТЗ Из ТЗ Цикл
		УчПлан = СТЗ.Ссылка.ПолучитьОбъект();		
		УчПлан.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерепровестиУчебныйПланМагистратураДО()
	Запрос = Новый Запрос();
	Запрос.Текст =  "ВЫБРАТЬ
	                |	УчебныйПланМагистратураДО.Ссылка,
	                |	УчебныйПланМагистратураДО.ГодВыпуска
	                |ИЗ
	                |	Документ.УчебныйПланМагистратураДО КАК УчебныйПланМагистратураДО
	                |ГДЕ
	                |	УчебныйПланМагистратураДО.ГодВыпуска <> ""2022""
	                |	И УчебныйПланМагистратураДО.ГодВыпуска <> ""2021""";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СТЗ Из ТЗ Цикл
		УчПлан = СТЗ.Ссылка.ПолучитьОбъект();		
		УчПлан.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерепровестиУчебныйПланМагистратураЗО()
	Запрос = Новый Запрос();
	Запрос.Текст =  "ВЫБРАТЬ
	                |	УчебныйПланМагистратураЗО.Ссылка,
	                |	УчебныйПланМагистратураЗО.ГодВыпуска
	                |ИЗ
	                |	Документ.УчебныйПланМагистратураЗО КАК УчебныйПланМагистратураЗО
	                |ГДЕ
	                |	УчебныйПланМагистратураЗО.ГодВыпуска <> ""2022""
	                |	И УчебныйПланМагистратураЗО.ГодВыпуска <> ""2021""";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СТЗ Из ТЗ Цикл
		УчПлан = СТЗ.Ссылка.ПолучитьОбъект();		
		УчПлан.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерепровестиУчебныйПланМагистратураИнГраждане()
	Запрос = Новый Запрос();
	Запрос.Текст =  "ВЫБРАТЬ
	                |	УчебныйПланМагистратураИнГраждане.Ссылка,
	                |	УчебныйПланМагистратураИнГраждане.ГодВыпуска
	                |ИЗ
	                |	Документ.УчебныйПланМагистратураИнГраждане КАК УчебныйПланМагистратураИнГраждане
	                |ГДЕ
	                |	УчебныйПланМагистратураИнГраждане.ГодВыпуска <> ""2022""
	                |	И УчебныйПланМагистратураИнГраждане.ГодВыпуска <> ""2021""";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СТЗ Из ТЗ Цикл
		УчПлан = СТЗ.Ссылка.ПолучитьОбъект();		
		УчПлан.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьДокументСДисциплинамиПоВыбору(Путь)
	Запрос = Новый Запрос();
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ДляСписковДисциплинКафедр.ФормаОбучения,
	                |	ДляСписковДисциплинКафедр.УчетныйНомерПлана.Наименование КАК УчетныйНомерПлана,
	                |	ДляСписковДисциплинКафедр.Дисциплина.Наименование КАК Дисциплина,
	                |	ДляСписковДисциплинКафедр.Примечание КАК ВыборДисциплины,
	                |	ДляСписковДисциплинКафедр.ГодНабора.Наименование КАК ГодНабора,
	                |	ДляСписковДисциплинКафедр.Семестр,
	                |	ДляСписковДисциплинКафедр.Курс,
	                |	ДляСписковДисциплинКафедр.Кафедра.Наименование КАК Кафедра,
	                |	ДляСписковДисциплинКафедр.КодСпециальности.Наименование КАК КодСпециальности,
					|	ДляСписковДисциплинКафедр.Регистратор.Специальность.Наименование КАК Специальность,
	                |	ДляСписковДисциплинКафедр.Регистратор.НазваниеСпециальности.Наименование КАК ПолноеНазвание,
	                |	ДляСписковДисциплинКафедр.Всего,
	                |	ДляСписковДисциплинКафедр.ЗачЕдиницы,
	                |	ДляСписковДисциплинКафедр.ВсегоЧасов
	                |ИЗ
	                |	РегистрСведений.ДляСписковДисциплинКафедр КАК ДляСписковДисциплинКафедр
	                |ГДЕ
	                |	(ДляСписковДисциплинКафедр.Примечание = ""выбор""
	                |			ИЛИ ДляСписковДисциплинКафедр.Примечание = ""не выбор"")
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ДляСписковДисциплинКафедр.Регистратор,
	                |	УчетныйНомерПлана,
	                |	Дисциплина";
	ТЗ = Запрос.Выполнить().Выгрузить();
	ЗаписатьТаблицуЗначенийВExcel(ТЗ, Путь);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Путь) Тогда
		Путь = "C:\Дисциплины по выбору.xlsx";
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьВсеДисциплиныПоВыбору(Путь)
	Запрос = Новый Запрос();
	Запрос.Текст =  "ВЫБРАТЬ
	                |	УчебныйПланДФОТЧ.Ссылка,
	                |	УчебныйПланДФОТЧ.Ссылка.ГодНабора КАК ГодНабора,
	                |	УчебныйПланДФОТЧ.Ссылка.КодСпециальности,
	                |	УчебныйПланДФОТЧ.Ссылка.Специальность.Наименование КАК Специальность,
	                |	УчебныйПланДФОТЧ.Ссылка.Направление,
	                |	УчебныйПланДФОТЧ.Дисциплина КАК Дисциплина,
	                |	УчебныйПланДФОТЧ.Сем КАК Сем,
	                |	УчебныйПланДФОТЧ.Курс,
	                |	УчебныйПланДФОТЧ.Кафедра,
	                |	УчебныйПланДФОТЧ.Примечание
	                |ИЗ
	                |	Документ.УчебныйПланДФО.ТЧ КАК УчебныйПланДФОТЧ
	                |ГДЕ
	                |	(УчебныйПланДФОТЧ.Примечание = ""выбор""
	                |			ИЛИ УчебныйПланДФОТЧ.Примечание = ""не выбор"")
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ГодНабора,
	                |	Специальность,
	                |	Сем,
	                |	Дисциплина";
	ТЗ = Запрос.Выполнить().Выгрузить();
	ЗаписатьТаблицуЗначенийВExcel(ТЗ, Путь);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВсюДФО(Команда)
	СохранитьВсеДисциплиныПоВыбору(Путь);
	Сообщить("Конец");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьВсюЗочкуНаСервере(Путь)
	Запрос = Новый Запрос();
	Запрос.Текст =  "ВЫБРАТЬ
	                |	УчебныйПланДФОТЧ.Ссылка.УчетныйНомерПлана.Наименование,
	                |	УчебныйПланДФОТЧ.Дисциплина.Наименование КАК Дисциплина,
	                |	УчебныйПланДФОТЧ.Примечание КАК ВыборДисциплины,
	                |	УчебныйПланДФОТЧ.Ссылка.ГодНабора.Наименование КАК ГодНабора,
	                |	УчебныйПланДФОТЧ.Сем КАК Сем,
	                |	УчебныйПланДФОТЧ.Курс,
	                |	УчебныйПланДФОТЧ.Кафедра.Наименование КАК Кафедра,
	                |	УчебныйПланДФОТЧ.Ссылка.КодСпециальности.Наименование КАК КодСпециальности,
	                |	УчебныйПланДФОТЧ.Ссылка.Специальность.Наименование КАК Специальность,
	                |	УчебныйПланДФОТЧ.Ссылка.НазваниеСпециальности.Наименование КАК ПолноеНазвание,
	                |	УчебныйПланДФОТЧ.Ссылка.Направление
	                |ИЗ
	                |	Документ.УчебныйПланДФО.ТЧ КАК УчебныйПланДФОТЧ
	                |ГДЕ
	                |	(УчебныйПланДФОТЧ.Примечание = ""выбор""
	                |			ИЛИ УчебныйПланДФОТЧ.Примечание = ""не выбор"")
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ГодНабора,
	                |	Специальность,
	                |	Сем,
	                |	Дисциплина";
	ТЗ = Запрос.Выполнить().Выгрузить();
	ЗаписатьТаблицуЗначенийВExcel(ТЗ, Путь);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВсюЗочку(Команда)
	ВыгрузитьВсюЗочкуНаСервере(Путь);
	Сообщить("Конец");
КонецПроцедуры