&НаКлиенте
Процедура РасчетНедель(Команда)
	РасчетНедельНаСервере();
КонецПроцедуры

&НаСервере
Процедура РасчетНедельНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроектыУПГрафикОбразовательногоПроцесса.Курс,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя1,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя2,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя3,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя4,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя5,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя6,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя7,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя8,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя9,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя10,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя11,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя12,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя13,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя14,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя15,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя16,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя17,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя18,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя19,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя20,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя21,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя22,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя23,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя24,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя25,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя26,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя27,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя28,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя29,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя30,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя31,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя32,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя33,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя34,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя35,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя36,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя37,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя38,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя39,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя40,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя41,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя42,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя43,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя44,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя45,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя46,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя47,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя48,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя49,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя50,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя51,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Неделя52,
		|	ПроектыУПГрафикОбразовательногоПроцесса.Примечание
		|ИЗ
		|	Документ.ПроектыУП.ГрафикОбразовательногоПроцесса КАК ПроектыУПГрафикОбразовательногоПроцесса
		|ГДЕ
		|	ПроектыУПГрафикОбразовательногоПроцесса.Ссылка.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", НомерПроекта);
	ТЗ_РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Объект.ГрафикОбразовательногоПроцесса.Загрузить(ТЗ_РезультатЗапроса);
	
	ЧислоНедель = Новый ТаблицаЗначений;
	ЧислоНедель.Колонки.Добавить("Курс", Новый ОписаниеТипов("СправочникСсылка.Курсы"));
	ЧислоНедель.Колонки.Добавить("Семестр", Новый ОписаниеТипов("Число"));
	ЧислоНедель.Колонки.Добавить("ЧислоНедель", Новый ОписаниеТипов("Число"));
	
	Для Каждого СТЗ Из ТЗ_РезультатЗапроса Цикл
		ОбщееКолНедель = 0;
		НеделиПервогоСема = 0;
		Для Инд = 1 По 52 Цикл	// Инд = Номер недели
			Если СТЗ[Инд].Наименование = "//" Тогда
				Прервать;
			КонецЕсли;
			Если СТЗ[Инд].Наименование = "" Тогда
				ОбщееКолНедель = ОбщееКолНедель + 1;
				Продолжить;
			КонецЕсли;
			Если НеделиПервогоСема = 0 Тогда
				НеделиПервогоСема = ОбщееКолНедель;
			КонецЕсли;
		КонецЦикла;
		
		Сем = (Число(СТЗ.Курс.Наименование) - 1) * 2 + 1;	// Курс в семестр
		ОсеннийКурс = ЧислоНедель.Добавить();
		ОсеннийКурс.Курс = СТЗ.Курс;
		ОсеннийКурс.Семестр = Сем;
		ОсеннийКурс.ЧислоНедель = НеделиПервогоСема;
		Если ОбщееКолНедель - НеделиПервогоСема > 0 Тогда 
			ВесеннийКурс = ЧислоНедель.Добавить();
			ВесеннийКурс.Курс = СТЗ.Курс;
			ВесеннийКурс.Семестр = Сем + 1;
			ВесеннийКурс.ЧислоНедель = ОбщееКолНедель - НеделиПервогоСема;
		КонецЕсли;
	КонецЦикла;	
	Служебный.ВывестиТаблицуЗначенияВКодеВТаблицуНаФорме(ЭтаФорма, ЧислоНедель);	
КонецПроцедуры
