// Модуль менеджера команд*

Процедура Выписка(ТабДок, Ссылка) Экспорт
	Если  Строка(Ссылка.ФормаОбучения) = "Дневная" Тогда
		ВыпискаДФО(ТабДок, Ссылка);
	ИначеЕсли Строка(Ссылка.ФормаОбучения) = "Заочная" Тогда	
		ВыпискаЗФО(ТабДок, Ссылка);
	КонецЕсли;
КонецПроцедуры

Процедура ВыпискаДФО(ТабДок, Ссылка)
	Курс = Строка(Константы.КонецУчебногоГода.Получить() - Ссылка.ГодНабора.ГодНабораЧислом);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Семестр.Наименование КАК Наименование,
	|	Семестр.ОсеньВесна КАК ОсеньВесна
	|ИЗ
	|	Справочник.Семестр КАК Семестр
	|ГДЕ
	|	Семестр.Курс.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Курс);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	массивСеместры = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ОсеньВесна = "осень" Тогда
			массивСеместры.Добавить(Справочники.Семестр.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.Наименование));
			ОсеннийСеместр = ВыборкаДетальныеЗаписи.Наименование
		ИначеЕсли ВыборкаДетальныеЗаписи.ОсеньВесна="весна" Тогда
			массивСеместры.Добавить(Справочники.Семестр.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.Наименование));
			ВесеннийСеместр = ВыборкаДетальныеЗаписи.Наименование
		КонецЕсли;
	КонецЦикла;
	Макет = Документы.УчебныйПланСпециальности.ПолучитьМакет("ВыпискаДФО");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧ");
	ОбластьДисциплины = Макет.ПолучитьОбласть("Дисциплины");
	ОбластьВсего = Макет.ПолучитьОбласть("Всего"); 
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал"); 
	ДанныеШапки = Новый Структура;
	ДанныеШапки.Вставить("УчебныйГод", Формат(Константы.НачалоУчебногоГода.Получить(), "ЧГ=0") + "/" + Формат(Константы.КонецУчебногоГода.Получить(), "ЧГ=0"));
	Если Строка(Ссылка.ФормаОбучения) = "Дневная" Тогда ФормаОбучения=" по дневной форме обучения"
	ИначеЕсли Строка(Ссылка.ФормаОбучения) = "Заочная" Тогда ФормаОбучения = " по заочной форме обучения"
	ИначеЕсли Строка(Ссылка.ФормаОбучения) = "Заочная (сокр.в/о)" Тогда ФормаОбучения = " по заочной сокращ. форме обучения на базе высшего"
	ИначеЕсли Строка(Ссылка.ФормаОбучения) = "Заочная (сокр.сс/о)" Тогда ФормаОбучения = " по заочной сокращ. форме обучения на базе ср.спец."
	ИначеЕсли Строка(Ссылка.ФормаОбучения) = "Дистанционная" Тогда ФормаОбучения = " по дистанционной форме обучения"
	КонецЕсли;
	ДанныеШапки.Вставить("ФормаОбучения", ФормаОбучения);
	ДанныеШапки.Вставить("ГодНабора", "" + Ссылка.ГодНабора + " года");
	ДанныеШапки.Вставить("Курс", Курс);
	ДанныеШапки.Вставить("Группы", Ссылка.НомераГрупп);
	ДанныеШапки.Вставить("Квалификация", Ссылка.Квалификация);
	
	ДанныеШапки.Вставить("Факультет", СтрЗаменить(Ссылка.Факультет.НазваниеФакультета.Наименование, "Факультет", "факультета"));
	ДанныеШапки.Вставить("Специальность", "«" + Ссылка.НазваниеСпециальности + "»");
	СпециализацияНаправление = ?(ЗначениеЗаполнено(Ссылка.Специализация), ", специализации " + "«" + Ссылка.Специализация + "»", "" + ?(ЗначениеЗаполнено(Ссылка.Специализация), ", специализации " + "«" + Ссылка.Специализация + "»", ""));
	ДанныеШапки.Вставить("Специализация",СпециализацияНаправление + ?(ЗначениеЗаполнено(Ссылка.Направление), "," + Символы.ПС + " направления " + "«" + Ссылка.Направление + "»", ""));
	
	Для Каждого Элемент из ДанныеШапки Цикл 
		ОбластьШапка.Параметры[Элемент.Ключ] = Элемент.Значение; 
	КонецЦикла;	
	ТабДок.Вывести(ОбластьШапка);
	ОбластьШапкаТЧ.Параметры.ОсеннийСеместр = ОсеннийСеместр;
	ОбластьШапкаТЧ.Параметры.ВесеннийСеместр = ВесеннийСеместр;
	ТабДок.Вывести(ОбластьШапкаТЧ);
	
	// Получаем Практики	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""Практика "" + ""("" + УчебныйПланСпециальностиПрактикиДПГЭК.Дисциплины.Наименование + "")"" КАК Дисциплины,
	|	УчебныйПланСпециальностиПрактикиДПГЭК.Семестр КАК Семестр,
	|	УчебныйПланСпециальностиПрактикиДПГЭК.ЧислоНедель КАК ЧислоНедель,
	|	УчебныйПланСпециальностиПрактикиДПГЭК.ЗачетныеЕдиницы КАК ЗачетныеЕдиницы,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиПрактикиДПГЭК.Семестр.ОсеньВесна = ""осень""
	|			ТОГДА УчебныйПланСпециальностиПрактикиДПГЭК.Семестр
	|	КОНЕЦ КАК СеместрОсень,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиПрактикиДПГЭК.Семестр.ОсеньВесна = ""весна""
	|			ТОГДА УчебныйПланСпециальностиПрактикиДПГЭК.Семестр
	|	КОНЕЦ КАК СеместрВесна,
	|	УчебныйПланСпециальностиПрактикиДПГЭК.Ссылка.ВыпускающаяКафедра.НазваниеКафедры КАК Кафедра,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиПрактикиДПГЭК.Семестр.ОсеньВесна = ""осень""
	|			ТОГДА УчебныйПланСпециальностиПрактикиДПГЭК.ЗачетныеЕдиницы
	|	КОНЕЦ КАК ЗачЕдОсень,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиПрактикиДПГЭК.Семестр.ОсеньВесна = ""весна""
	|			ТОГДА УчебныйПланСпециальностиПрактикиДПГЭК.ЗачетныеЕдиницы
	|	КОНЕЦ КАК ЗачЕдВесна,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиПрактикиДПГЭК.Семестр.ОсеньВесна = ""осень""
	|			ТОГДА УчебныйПланСпециальностиПрактикиДПГЭК.ЧислоНедель
	|	КОНЕЦ КАК ЧислоНедельОсень,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиПрактикиДПГЭК.Семестр.ОсеньВесна = ""весна""
	|			ТОГДА УчебныйПланСпециальностиПрактикиДПГЭК.ЧислоНедель
	|	КОНЕЦ КАК ЧислоНедельВесна,
	|	""НЕОсновныеКомпоненты"" КАК ОсновнаяКомпонента,
	|	""Практики"" КАК МодульНаименование,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиПрактикиДПГЭК.Семестр.ОсеньВесна = ""весна""
	|			ТОГДА 1
	|	КОНЕЦ КАК ЗачДифЗачВесна,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиПрактикиДПГЭК.Семестр.ОсеньВесна = ""осень""
	|			ТОГДА 1
	|	КОНЕЦ КАК ЗачДифЗачОсень
	|ИЗ
	|	Документ.УчебныйПланСпециальности.ПрактикиДПГЭК КАК УчебныйПланСпециальностиПрактикиДПГЭК
	|ГДЕ
	|	УчебныйПланСпециальностиПрактикиДПГЭК.Ссылка.УчетныйНомер = &УчетныйНомер
	|	И УчебныйПланСпециальностиПрактикиДПГЭК.Семестр В(&Семестр)
	|	И УчебныйПланСпециальностиПрактикиДПГЭК.Разделы ПОДОБНО ""%"" + ""практики"" + ""%""";
	Запрос.УстановитьПараметр("Семестр", МассивСеместры);
	Запрос.УстановитьПараметр("УчетныйНомер", Ссылка.УчетныйНомер);
	ТЗ_Практики = Запрос.Выполнить().Выгрузить();	
	
	// Выгружаем курсовые работы	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Сем.ОсеньВесна = ""осень""
	|			ТОГДА УчебныйПланСпециальностиДисциплины.Сем
	|	КОНЕЦ КАК СеместрОсень,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Сем.ОсеньВесна = ""весна""
	|			ТОГДА УчебныйПланСпециальностиДисциплины.Сем
	|	КОНЕЦ КАК СеместрВесна,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Сем.ОсеньВесна = ""весна""
	|			ТОГДА УчебныйПланСпециальностиДисциплины.ВсегоЧасов
	|	КОНЕЦ КАК ВсегоВесна,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Сем.ОсеньВесна = ""осень""
	|			ТОГДА УчебныйПланСпециальностиДисциплины.ВсегоЧасов
	|	КОНЕЦ КАК ВсегоОсень,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Сем.ОсеньВесна = ""осень""
	|			ТОГДА УчебныйПланСпециальностиДисциплины.ЗачетныеЕдиницы
	|	КОНЕЦ КАК ЗачЕдОсень,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Сем.ОсеньВесна = ""весна""
	|			ТОГДА УчебныйПланСпециальностиДисциплины.ЗачетныеЕдиницы
	|	КОНЕЦ КАК ЗачЕдВесна,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Сем.ОсеньВесна = ""весна""
	|			ТОГДА УчебныйПланСпециальностиДисциплины.ЧислоНедель
	|	КОНЕЦ КАК ЧислоНедельВесна,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Сем.ОсеньВесна = ""осень""
	|			ТОГДА УчебныйПланСпециальностиДисциплины.ЧислоНедель
	|	КОНЕЦ КАК ЧислоНедельОсень,
	|	УчебныйПланСпециальностиДисциплины.Кафедра.НазваниеКафедры КАК Кафедра,
	|	НагрузкаПоКурсовымРаботамДисциплины.Дисциплина.Наименование КАК ПоДисциплине,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Сем.ОсеньВесна = ""осень""
	|			ТОГДА 1
	|	КОНЕЦ КАК КРОсень,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Сем.ОсеньВесна = ""весна""
	|			ТОГДА 1
	|	КОНЕЦ КАК КРВесна,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Компонента.Наименование = ""Государственный компонент""
	|			ТОГДА 2
	|		КОГДА УчебныйПланСпециальностиДисциплины.Компонента.Наименование = ""Компонент учреждения высшего образования""
	|			ТОГДА 3
	|		КОГДА УчебныйПланСпециальностиДисциплины.Компонента.Наименование = ""Дополнительные виды обучения""
	|			ТОГДА 4
	|		КОГДА УчебныйПланСпециальностиДисциплины.Компонента.Наименование = ""Факультативные дисциплины""
	|			ТОГДА 5
	|	КОНЕЦ КАК ДляСортировки,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Модуль.Наименование <> """"""""
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ДляСортировкиПоМодулям
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	Документ.НагрузкаПоКурсовымРаботам.Дисциплины КАК НагрузкаПоКурсовымРаботамДисциплины,
	|	Документ.УчебныйПланСпециальности.Дисциплины КАК УчебныйПланСпециальностиДисциплины
	|ГДЕ
	|	НагрузкаПоКурсовымРаботамДисциплины.УчетныйНомер = &УчетныйНомер
	|	И УчебныйПланСпециальностиДисциплины.Ссылка.УчетныйНомер = &УчетныйНомер
	|	И ПОДСТРОКА(УчебныйПланСпециальностиДисциплины.Дисциплина.Наименование, 1, 15) = ""Курсовая работа""
	|	И УчебныйПланСпециальностиДисциплины.Сем В(&Семестр)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.СеместрОсень КАК СеместрОсень,
	|	Данные.СеместрВесна КАК СеместрВесна,
	|	Данные.ВсегоВесна КАК ВсегоВесна,
	|	Данные.ВсегоОсень КАК ВсегоОсень,
	|	Данные.ЗачЕдОсень КАК ЗачЕдОсень,
	|	Данные.ЗачЕдВесна КАК ЗачЕдВесна,
	|	Данные.ЧислоНедельВесна КАК ЧислоНедельВесна,
	|	Данные.ЧислоНедельОсень КАК ЧислоНедельОсень,
	|	Данные.ПоДисциплине КАК ПоДисциплине,
	|	Данные.КРОсень КАК КРОсень,
	|	Данные.КРВесна КАК КРВесна,
	|	Данные.ДляСортировки КАК ДляСортировки,
	|	ВЫБОР
	|		КОГДА Данные.ДляСортировки = 2
	|				ИЛИ Данные.ДляСортировки = 3
	|			ТОГДА ""ОсновныеКомпоненты""
	|		ИНАЧЕ ""НЕОсновныеКомпоненты""
	|	КОНЕЦ КАК ОсновнаяКомпонента,
	|	Данные.ДляСортировкиПоМодулям КАК ДляСортировкиПоМодулям,
	|	Данные.Кафедра КАК Кафедра
	|ИЗ
	|	Данные КАК Данные";
	Запрос.УстановитьПараметр("Семестр", МассивСеместры);	
	Запрос.УстановитьПараметр("УчетныйНомер", Ссылка.УчетныйНомер);
	
	ТЗ_КР = Запрос.Выполнить().Выгрузить();
	Если ТЗ_КР.Количество() > 0 Тогда
		ТЗ_КР.Колонки.Добавить("Дисциплины", Новый ОписаниеТипов("Строка"));
		Для Каждого Строка Из ТЗ_КР Цикл
			Дисциплина = "" + Дисциплина + ?(ЗначениеЗаполнено(Дисциплина), ", ", "") + Строка.ПоДисциплине;// добавляем дисциплины в строку
		КонецЦикла;
		Дисциплина = "Курсовая работа: "+Дисциплина;
		ТЗ_КР.ЗаполнитьЗначения(Дисциплина,"Дисциплины");
		ТЗ_КурсовыеРаботы = ТЗ_КР.СкопироватьКолонки();
		ЗаполнитьЗначенияСвойств(ТЗ_КурсовыеРаботы.Добавить(), ТЗ_КР[0]); 
	КонецЕсли;	
	// Курсовые работы выгружены
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчебныйПланСпециальностиДисциплины.Ссылка.УчетныйНомер КАК УчетныйНомер,
	|	УчебныйПланСпециальностиДисциплины.Ссылка.ФормаОбучения КАК ФормаОбучения,
	|	УчебныйПланСпециальностиДисциплины.Ссылка.ГодНабора КАК ГодНабора,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.ПоВыбору <> """"
	|			ТОГДА ""*/ "" + УчебныйПланСпециальностиДисциплины.Дисциплина.Наименование
	|		ИНАЧЕ УчебныйПланСпециальностиДисциплины.Дисциплина
	|	КОНЕЦ КАК Дисциплина,
	|	УчебныйПланСпециальностиДисциплины.Сем КАК Сем,
	|	УчебныйПланСпециальностиДисциплины.Курс КАК Курс,
	|	УчебныйПланСпециальностиДисциплины.Кафедра.Наименование КАК Кафедра,
	|	УчебныйПланСпециальностиДисциплины.ВсегоЧасов КАК ВсегоЧасов,
	|	УчебныйПланСпециальностиДисциплины.ЛК КАК ЛК,
	|	УчебныйПланСпециальностиДисциплины.ПЗ КАК ПЗ,
	|	УчебныйПланСпециальностиДисциплины.ЛБ КАК ЛБ,
	|	УчебныйПланСпециальностиДисциплины.СЗ КАК СЗ,
	|	УчебныйПланСпециальностиДисциплины.Сем.ОсеньВесна КАК СемОсеньВесна,
	|	УчебныйПланСпециальностиДисциплины.КР КАК КР,
	|	УчебныйПланСпециальностиДисциплины.Контр КАК Контр,
	|	УчебныйПланСпециальностиДисциплины.Экз КАК Экз,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Зач <> 0
	|				ИЛИ УчебныйПланСпециальностиДисциплины.ДЗ <> 0
	|			ТОГДА 1
	|	КОНЕЦ КАК ЗачДифЗач,
	|	УчебныйПланСпециальностиДисциплины.ДЗ КАК ДЗ,
	|	УчебныйПланСпециальностиДисциплины.ВсегоАудиторных КАК ВсегоАудиторных,
	|	УчебныйПланСпециальностиДисциплины.ЗачетныеЕдиницы КАК ЗачЕд,
	|	УчебныйПланСпециальностиДисциплины.Кафедра.НазваниеКафедры КАК КафедраНазваниеКафедры,
	|	УчебныйПланСпециальностиДисциплины.ЧислоНедель КАК ЧислоНедель,
	|	УчетСУРСПриложениеКПланамПоСУРС.ЛКСУРС КАК ЛКСУРС,
	|	УчетСУРСПриложениеКПланамПоСУРС.ПЗСУРС + УчетСУРСПриложениеКПланамПоСУРС.СЗСУРС КАК ПЗСЗСУРС,
	|	УчетСУРСПриложениеКПланамПоСУРС.ЛБСУРС КАК ЛБСУРС,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Компонента.Наименование = ""Государственный компонент""
	|			ТОГДА 2
	|		КОГДА УчебныйПланСпециальностиДисциплины.Компонента.Наименование = ""Компонент учреждения высшего образования""
	|			ТОГДА 3
	|		КОГДА УчебныйПланСпециальностиДисциплины.Компонента.Наименование = ""Дополнительные виды обучения""
	|			ТОГДА 4
	|		КОГДА УчебныйПланСпециальностиДисциплины.Компонента.Наименование = ""Факультативные дисциплины""
	|			ТОГДА 5
	|	КОНЕЦ КАК ДляСортировки,
	|	УчебныйПланСпециальностиДисциплины.ЦиклДисциплин.Наименование КАК ЦиклДисциплинНаименование,
	|	ВЫБОР
	|		КОГДА УчебныйПланСпециальностиДисциплины.Модуль.Наименование <> """"
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ДляСортировкиПоМодулям,
	|	УчебныйПланСпециальностиДисциплины.Модуль.Наименование КАК МодульНаименование
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	Документ.УчебныйПланСпециальности.Дисциплины КАК УчебныйПланСпециальностиДисциплины
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетСУРС.ПриложениеКПланамПоСУРС КАК УчетСУРСПриложениеКПланамПоСУРС
	|		ПО УчебныйПланСпециальностиДисциплины.Ссылка.УчетныйНомер = УчетСУРСПриложениеКПланамПоСУРС.Ссылка.УчетныйНомерПлана
	|			И УчебныйПланСпециальностиДисциплины.Сем = УчетСУРСПриложениеКПланамПоСУРС.Сем
	|			И УчебныйПланСпециальностиДисциплины.Дисциплина = УчетСУРСПриложениеКПланамПоСУРС.Дисциплина
	|ГДЕ
	|	УчебныйПланСпециальностиДисциплины.Ссылка.УчетныйНомер = &УчетныйНомер
	|	И ПОДСТРОКА(УчебныйПланСпециальностиДисциплины.Дисциплина.Наименование, 1, 8) <> ""Курсовая""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчебныйПланСпециальности.УчетныйНомер КАК УчетныйНомер,
	|	КонецУчебногоГода.Значение - УчебныйПланСпециальности.ГодНабора.ГодНабораЧислом КАК ТекущийКурс
	|ПОМЕСТИТЬ ТекКурс
	|ИЗ
	|	Документ.УчебныйПланСпециальности КАК УчебныйПланСпециальности,
	|	Константа.КонецУчебногоГода КАК КонецУчебногоГода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Дисциплина КАК Дисциплина,
	|	Данные.КафедраНазваниеКафедры.Наименование КАК Кафедра,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.Сем
	|	КОНЕЦ КАК СеместрОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.Сем
	|	КОНЕЦ КАК СеместрВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.ВсегоЧасов
	|	КОНЕЦ КАК ВсегоВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.ВсегоЧасов
	|	КОНЕЦ КАК ВсегоОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.ЛК
	|	КОНЕЦ КАК ЛКВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.ПЗ
	|	КОНЕЦ КАК ПЗВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.ЛК
	|	КОНЕЦ КАК ЛКОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.ПЗ
	|	КОНЕЦ КАК ПЗОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.ЛБ
	|	КОНЕЦ КАК ЛБВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.ЛБ
	|	КОНЕЦ КАК ЛБОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.СЗ
	|	КОНЕЦ КАК СЗВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.СЗ
	|	КОНЕЦ КАК СЗОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.КР
	|	КОНЕЦ КАК КРВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.Контр
	|	КОНЕЦ КАК КонтрВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.КР
	|	КОНЕЦ КАК КРОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.Контр
	|	КОНЕЦ КАК КонтрОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.ЗачДифЗач
	|	КОНЕЦ КАК ЗачДифЗачВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.ЗачДифЗач
	|	КОНЕЦ КАК ЗачДифЗачОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.Экз
	|	КОНЕЦ КАК ЭкзВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.Экз
	|	КОНЕЦ КАК ЭкзОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.ВсегоАудиторных
	|	КОНЕЦ КАК ВсегоАудОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.ВсегоАудиторных
	|	КОНЕЦ КАК ВсегоАудВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.ЗачЕд
	|	КОНЕЦ КАК ЗачЕдОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.ЗачЕд
	|	КОНЕЦ КАК ЗачЕдВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.ЧислоНедель
	|	КОНЕЦ КАК ЧислоНедельОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.ЧислоНедель
	|	КОНЕЦ КАК ЧислоНедельВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.ЛКСУРС
	|	КОНЕЦ КАК ЛКСУРСОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.ЛКСУРС
	|	КОНЕЦ КАК ЛКСУРСВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.ПЗСЗСУРС
	|	КОНЕЦ КАК ПЗСЗСУРСОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.ПЗСЗСУРС
	|	КОНЕЦ КАК ПЗСЗСУРСВесна,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""осень""
	|			ТОГДА Данные.ЛБСУРС
	|	КОНЕЦ КАК ЛБСУРСОсень,
	|	ВЫБОР
	|		КОГДА Данные.СемОсеньВесна = ""весна""
	|			ТОГДА Данные.ЛБСУРС
	|	КОНЕЦ КАК ЛБСУРСВесна,
	|	Данные.ДляСортировки КАК ДляСортировки,
	|	Данные.ДляСортировкиПоМодулям КАК ДляСортировкиПоМодулям,
	|	Данные.МодульНаименование КАК МодульНаименование
	|ПОМЕСТИТЬ Финал
	|ИЗ
	|	Данные КАК Данные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекКурс КАК ТекКурс
	|		ПО Данные.УчетныйНомер = ТекКурс.УчетныйНомер
	|			И Данные.Курс.КурсЧислом = ТекКурс.ТекущийКурс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Финал.ДляСортировки = 5
	|			ТОГДА ""Факультатив""
	|		КОГДА Финал.ДляСортировки = 4
	|			ТОГДА ""Дополнительное обучение""
	|		ИНАЧЕ Финал.МодульНаименование
	|	КОНЕЦ КАК МодульНаименование,
	|	Финал.Дисциплина КАК Дисциплины,
	|	Финал.Кафедра КАК Кафедра,
	|	МАКСИМУМ(Финал.СеместрОсень) КАК СеместрОсень,
	|	СУММА(Финал.ЛКОсень) КАК ЛКОсень,
	|	СУММА(Финал.ПЗОсень) КАК ПЗОсень,
	|	СУММА(Финал.ЛБОсень) КАК ЛБОсень,
	|	СУММА(Финал.СЗОсень) КАК СЗОсень,
	|	СУММА(Финал.ЛКСУРСОсень) КАК ЛКСУРСОсень,
	|	СУММА(Финал.ПЗСЗСУРСОсень) КАК ПЗСЗСУРСОсень,
	|	СУММА(Финал.ЛБСУРСОсень) КАК ЛБСУРСОсень,
	|	СУММА(Финал.КРОсень) КАК КРОсень,
	|	СУММА(Финал.КонтрОсень) КАК КонтрОсень,
	|	СУММА(Финал.ЗачДифЗачОсень) КАК ЗачДифЗачОсень,
	|	СУММА(Финал.ЭкзОсень) КАК ЭкзОсень,
	|	СУММА(Финал.ВсегоАудОсень) КАК ВсегоАудОсень,
	|	СУММА(Финал.ЗачЕдОсень) КАК ЗачЕдОсень,
	|	СУММА(Финал.ЧислоНедельОсень) КАК ЧислоНедельОсень,
	|	СУММА(Финал.ВсегоОсень) КАК ВсегоОсень,
	|	МАКСИМУМ(Финал.СеместрВесна) КАК СеместрВесна,
	|	СУММА(Финал.ЛКВесна) КАК ЛКВесна,
	|	СУММА(Финал.ПЗВесна) КАК ПЗВесна,
	|	СУММА(Финал.ЛБВесна) КАК ЛБВесна,
	|	СУММА(Финал.СЗВесна) КАК СЗВесна,
	|	СУММА(Финал.ЛКСУРСВесна) КАК ЛКСУРСВесна,
	|	СУММА(Финал.ПЗСЗСУРСВесна) КАК ПЗСЗСУРСВесна,
	|	СУММА(Финал.ЛБСУРСВесна) КАК ЛБСУРСВесна,
	|	СУММА(Финал.КРВесна) КАК КРВесна,
	|	СУММА(Финал.ЗачДифЗачВесна) КАК ЗачДифЗачВесна,
	|	СУММА(Финал.ЭкзВесна) КАК ЭкзВесна,
	|	СУММА(Финал.КонтрВесна) КАК КонтрВесна,
	|	СУММА(Финал.ЗачЕдВесна) КАК ЗачЕдВесна,
	|	СУММА(Финал.ВсегоАудВесна) КАК ВсегоАудВесна,
	|	СУММА(Финал.ЧислоНедельВесна) КАК ЧислоНедельВесна,
	|	СУММА(Финал.ВсегоВесна) КАК ВсегоВесна,
	|	Финал.ДляСортировки КАК ДляСортировки,
	|	Финал.ДляСортировкиПоМодулям КАК ДляСортировкиПоМодулям,
	|	ВЫБОР
	|		КОГДА Финал.ДляСортировки = 2
	|				ИЛИ Финал.ДляСортировки = 3
	|			ТОГДА ""ОсновныеКомпоненты""
	|		ИНАЧЕ ""НЕОсновныеКомпоненты""
	|	КОНЕЦ КАК ОсновнаяКомпонента
	|ИЗ
	|	Финал КАК Финал
	|
	|СГРУППИРОВАТЬ ПО
	|	Финал.Кафедра,
	|	Финал.ДляСортировки,
	|	Финал.ДляСортировкиПоМодулям,
	|	Финал.Дисциплина,
	|	ВЫБОР
	|		КОГДА Финал.ДляСортировки = 5
	|			ТОГДА ""Факультатив""
	|		КОГДА Финал.ДляСортировки = 4
	|			ТОГДА ""Дополнительное обучение""
	|		ИНАЧЕ Финал.МодульНаименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Финал.ДляСортировки = 2
	|				ИЛИ Финал.ДляСортировки = 3
	|			ТОГДА ""ОсновныеКомпоненты""
	|		ИНАЧЕ ""НЕОсновныеКомпоненты""
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДляСортировкиПоМодулям,
	|	ДляСортировки,
	|	МодульНаименование";
	Запрос.УстановитьПараметр("УчетныйНомер", Ссылка.УчетныйНомер);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Служебный.ДополнитьТаблицу(ТЗ_Практики, ТЗ);
	Если ТЗ_КурсовыеРаботы <> Неопределено Тогда
		Служебный.ДополнитьТаблицу(ТЗ_КурсовыеРаботы, ТЗ);
	КонецЕсли;
	
	Отбор = Новый Структура; // Отбор и вывод для основных компонентов
	Отбор.Вставить("ОсновнаяКомпонента", "ОсновныеКомпоненты");
	ТЗ_Копия = ТЗ.Скопировать(Отбор);
	
	
	// *************  Делаем объединение строк по модулю "Философия" и "Политология" ************	
	МодФил = ОбъединениеМодулейФилПолитНов(ТЗ_Копия, "Философия");
	Если МодФил <> Неопределено Тогда
		Фил = ТЗ_Копия.Добавить();
		ЗаполнитьЗначенияСвойств(Фил, МодФил);
	КонецЕсли;
	МодПолит = ОбъединениеМодулейФилПолитНов(ТЗ_Копия, "Политология");
	Если МодПолит <> Неопределено Тогда
		Полит = ТЗ_Копия.Добавить();
		ЗаполнитьЗначенияСвойств(Полит, МодПолит);
	КонецЕсли;
	
	// *************  Заполняем дисциплины ************
	Для Каждого ЭлементСтрока Из ТЗ_Копия Цикл
		ОбластьДисциплины.Параметры.Заполнить(ЭлементСтрока);
		ТабДок.Вывести(ОбластьДисциплины);
	КонецЦикла;
	
	ТЗ_Копия.Свернуть("ОсновнаяКомпонента","ВсегоОсень,ВсегоАудОсень,ЛКОсень,ПЗОсень,СЗОсень,ЛБОсень,ЛКСУРСОсень,ПЗСЗСУРСОсень,ЛБСУРСОсень,КРОсень,КонтрОсень,ЭкзОсень,ЗачДифЗачОсень,ЗачЕдОсень,ВсегоВесна,ВсегоАудВесна,ЛКВесна,ПЗВесна,СЗВесна,ЛБВесна,ЛКСУРСВесна,ПЗСЗСУРСВесна,ЛБСУРСВесна,КРВесна,КонтрВесна,ЭкзВесна,ЗачДифЗачВесна,ЗачЕдВесна");	
	Для Каждого ИтогСтрока Из ТЗ_Копия Цикл
		ОбластьВсего.Параметры.Заполнить(ИтогСтрока);
		ТабДок.Вывести(ОбластьВсего);
	КонецЦикла;  
	Отбор = Новый Структура; // Отбор для Не основных компонентов
	Отбор.Вставить("ОсновнаяКомпонента","НЕОсновныеКомпоненты");
	ТЗ_Копия = ТЗ.Скопировать(Отбор);
	Для Каждого ЭлементСтрока Из ТЗ_Копия Цикл
		ОбластьДисциплины.Параметры.Заполнить(ЭлементСтрока);
		ТабДок.Вывести(ОбластьДисциплины);
	КонецЦикла;
	
	// Вывод подвала
	ОбластьПодвал.Параметры.ФИОДекана = Ссылка.Факультет.ФИОДекана;
	ТабДок.Вывести(ОбластьПодвал);
	
	// Объединяем Ячейки с модулями
	ОбъединениеНачало = 10;
	Для Строка = 10 По ТабДок.ВысотаТаблицы Цикл
		Если ТабДок.Область("R" + Строка + "C1").Текст = ТабДок.Область("R" + Строка(Строка - 1) + "C1").Текст
			ИЛИ ОбъединениеНачало = Строка Тогда Продолжить;
		Иначе
			ТабДок.Область("R" + ОбъединениеНачало + "C1" + ":" + "R" + Строка(Строка - 1) + "C1").Объединить();
			ОбъединениеНачало = Строка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ОбъединениеМодулейФилПолитНов(ТЗ, ИмяМодуля)
	Отбор = Новый Структура("МодульНаименование", ИмяМодуля);
	ТЗВрем = ТЗ.Скопировать(Отбор);
	Если ТЗВрем.Количество() < 2 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	СтрокиМодуля = ТЗ.НайтиСтроки(Отбор);
	ТЗВрем.Сортировать("Дисциплины убыв");
	
	Для Каждого Модули Из СтрокиМодуля Цикл
		ТЗ.Удалить(Модули);
	КонецЦикла;
	Кафедра = "";	
	Для Каждого Элемент Из ТЗВрем Цикл
		Кафедра = ?(Кафедра <> "", Кафедра + ", ", "") + Элемент.Кафедра;
	КонецЦикла;
	ТЗВрем.ЗаполнитьЗначения(Кафедра, "Кафедра");
	ТЗВрем.ЗаполнитьЗначения(ТЗВрем[0].Дисциплины, "Дисциплины");
	ТЗВрем.Свернуть("ОсновнаяКомпонента,МодульНаименование,Дисциплины,Кафедра,СеместрОсень,СеместрВесна,ДляСортировки,ДляСортировкиПоМодулям,ЧислоНедельОсень,ЧислоНедельВесна","ВсегоОсень,ВсегоАудОсень,ЛКОсень,ПЗОсень,СЗОсень,ЛБОсень,ЛКСУРСОсень,ПЗСЗСУРСОсень,ЛБСУРСОсень,КРОсень,КонтрОсень,ЭкзОсень,ЗачДифЗачОсень,ЗачЕдОсень,ВсегоВесна,ВсегоАудВесна,ЛКВесна,ПЗВесна,СЗВесна,ЛБВесна,ЛКСУРСВесна,ПЗСЗСУРСВесна,ЛБСУРСВесна,КРВесна,КонтрВесна,ЭкзВесна,ЗачДифЗачВесна,ЗачЕдВесна");
	ТЗВрем[0].ЭкзВесна = ?(ТЗВрем[0].ЭкзВесна > 0, 1, 0);
	ТЗВрем[0].ЗачДифЗачВесна = ?(ТЗВрем[0].ЗачДифЗачВесна > 0, 1, 0);
	ТЗВрем[0].ЭкзОсень = ?(ТЗВрем[0].ЭкзВесна > 0, 1, 0);
	ТЗВрем[0].ЗачДифЗачОсень = ?(ТЗВрем[0].ЗачДифЗачОсень > 0, 1, 0);
	Возврат ТЗВрем[0]; 
КонецФункции