ВЫБРАТЬ
	УчебныйПланСпециальности.ГодНабора КАК ГодНабора,
	КонецУчебногоГода.Значение - УчебныйПланСпециальности.ГодНабора.ГодНабораЧислом КАК ТекущийКурс,
	УчебныйПланСпециальности.Ссылка КАК Ссылка
ПОМЕСТИТЬ ДляТекКурса
ИЗ
	Константа.КонецУчебногоГода КАК КонецУчебногоГода,
	Документ.УчебныйПланСпециальности КАК УчебныйПланСпециальности
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВЫБОР
		КОГДА УчебныйПланСпециальностиДисциплины.Дисциплина.ГруппаИспользования = "2ИнЯз"
			ТОГДА "Второй иностранный"
		ИНАЧЕ "Первый иностранный"
	КОНЕЦ КАК КатегорияЯзыка,
	УчебныйПланСпециальностиДисциплины.Ссылка.УчетныйНомер КАК УчетныйНомер,
	УчебныйПланСпециальностиДисциплины.Ссылка.ФормаОбучения КАК ФормаОбучения,
	ДляТекКурса.ГодНабора КАК ГодНабора,
	УчебныйПланСпециальностиДисциплины.Ссылка.Специальность КАК Специальность,
	УчебныйПланСпециальностиДисциплины.Дисциплина КАК Дисциплина,
	УчебныйПланСпециальностиДисциплины.Курс КАК Курс,
	УчебныйПланСпециальностиДисциплины.Сем КАК Сем,
	УчебныйПланСпециальностиДисциплины.Сем.ОсеньВесна КАК СемОсеньВесна,
	УчебныйПланСпециальностиДисциплины.ЛК КАК ЛК,
	УчебныйПланСпециальностиДисциплины.ПЗ КАК ПЗ,
	УчебныйПланСпециальностиДисциплины.ЛБ КАК ЛБ,
	УчебныйПланСпециальностиДисциплины.Зач КАК Зач,
	УчебныйПланСпециальностиДисциплины.Экз КАК Экз,
	УчебныйПланСпециальностиДисциплины.Кафедра КАК Кафедра,
	СтудентыБГЭУ.Группа.Наименование КАК ГруппаНаименование,
	СтудентыБГЭУ.Наименование КАК ФИОСтудента,
	СтудентыБГЭУ.ИзучаемыйЯзык КАК ИзучаемыйЯзык,
	ВЫБОР
		КОГДА УчебныйПланСпециальностиДисциплины.Компонента.Наименование = "Факультативные дисциплины"
			ТОГДА "Факультатив"
		ИНАЧЕ "Обязательное изучение"
	КОНЕЦ КАК Факультатив,
	1 КАК Студентов,
	СтудентыБГЭУ.ГруппаПоИнЯзыку КАК ГруппаПоИнЯзыку
ПОМЕСТИТЬ Финал
ИЗ
	ДляТекКурса КАК ДляТекКурса
		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УчебныйПланСпециальности.Дисциплины КАК УчебныйПланСпециальностиДисциплины
			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтудентыБГЭУ КАК СтудентыБГЭУ
			ПО УчебныйПланСпециальностиДисциплины.Ссылка.УчетныйНомер = СтудентыБГЭУ.УчетныйНомерПлана
		ПО ДляТекКурса.Ссылка = УчебныйПланСпециальностиДисциплины.Ссылка
			И ДляТекКурса.ТекущийКурс = УчебныйПланСпециальностиДисциплины.Курс.КурсЧислом
ГДЕ
	УчебныйПланСпециальностиДисциплины.Кафедра.Принадлежность = "Иностранный язык"
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	Финал.КатегорияЯзыка КАК КатегорияЯзыка,
	Финал.УчетныйНомер КАК УчетныйНомер,
	Финал.ФормаОбучения КАК ФормаОбучения,
	Финал.ГодНабора КАК ГодНабора,
	Финал.Специальность КАК Специальность,
	Финал.Дисциплина КАК Дисциплина,
	Финал.Курс КАК Курс,
	Финал.Сем КАК Сем,
	Финал.СемОсеньВесна КАК СемОсеньВесна,
	Финал.ЛК КАК ЛК,
	Финал.ПЗ КАК ПЗ,
	Финал.ЛБ КАК ЛБ,
	Финал.Зач КАК Зач,
	Финал.Экз КАК Экз,
	Финал.Кафедра КАК Кафедра,
	Финал.ГруппаНаименование КАК ГруппаНаименование,
	Финал.ФИОСтудента КАК ФИОСтудента,
	Финал.ИзучаемыйЯзык КАК ИзучаемыйЯзык,
	Финал.Факультатив КАК Факультатив,
	Финал.Студентов КАК Студентов,
	Финал.ГруппаПоИнЯзыку КАК ГруппаПоИнЯзыку
ИЗ
	Финал КАК Финал
{ГДЕ
	(Финал.СемОсеньВесна = &СемОсеньВесна),
	(Финал.КатегорияЯзыка = &КатегорияЯзыка)}