&НаКлиенте
Процедура РазвернутьСвернутьНаВесьЭкран()
	Wshell = Новый COMОбъект("Wscript.shell");
	Wshell.SendKeys("^+`");
	Wshell.SendKeys("^+ё"); // 2 раза - для разных раскладок клавиатуры
КонецПроцедуры

&НаКлиенте
Процедура Лого1Нажатие(Элемент)
	РазвернутьСвернутьНаВесьЭкран()
КонецПроцедуры

&НаКлиенте
Процедура ЛогоНажатие(Элемент)
	РазвернутьСвернутьНаВесьЭкран()
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.СтрокаДанных.Заголовок = "Формирование списков студентов для кафедр иностранных языков";
	Элементы.Декорация1.Заголовок = "Используйте отборы для формирования списков";
	Элементы.Найти("ПоказатьОтборы").Заголовок = "Скрыть отборы";
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтборы(Команда)
	Если Элементы.Найти("ПоказатьОтборы").Заголовок = "Скрыть отборы" Тогда
		Элементы.Найти("ПоказатьОтборы").Заголовок = "Показать отборы";
		Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Ложь;
	Иначе
		Элементы.Найти("ПоказатьОтборы").Заголовок = "Скрыть отборы";
		Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	ПолучитьДанныеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПолучитьДанныеНаСервере()
	НастройкиСКД = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	
	// Пробегаемся по настройкам СКД и высчитываем отступ до данных в табличном документе
	Смещение = 1;
	Для Каждого Парам Из НастройкиСКД.ПараметрыДанных.Элементы Цикл
		Если Парам.Использование = Истина Тогда
			Смещение = Смещение + 1;
		КонецЕсли;
	КонецЦикла;
	Для Каждого Отбор Из НастройкиСКД.Отбор.Элементы Цикл
		Если Отбор.Использование = Истина Тогда
			Смещение = Смещение + 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Смещение <> 1 Тогда
		Смещение = Смещение + 2;
	КонецЕсли;	
	
	ПоследняяСтрока = Результат.ВысотаТаблицы;
	ПоследняяКолонка = Результат.ШиринаТаблицы;
	ОбластьЯчеек = Результат.Область(Смещение, 1, ПоследняяСтрока, ПоследняяКолонка);
	// Создаем описание источника данных на основании области ячеек табличного документа.
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	// Создаем объект для интеллектуального построения отчетов, указываем источник данных и выполняем построение отчета.
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	ТЗ = ПостроительОтчета.Результат.Выгрузить();
	ТЗ.Удалить(0);
	ТЗ.Удалить(ТЗ.Количество() - 1);
КонецПроцедуры