&НаКлиенте
Процедура ОбновитьРеквизитНаличияИнЯз(Команда)
	ОбновитьИнЯз();
	Сообщить("Готово");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроставитьИнЯз()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УчебныйПланСпециальности.УчетныйНомер КАК Ссылка,
	               |	УчебныйПланСпециальности.УчетныйНомер.Наименование КАК УчНомер,
	               |	ПланыСИнЯзНаТекКурсе.Ссылка КАК ИнЯз
	               |ИЗ
	               |	Документ.УчебныйПланСпециальности КАК УчебныйПланСпециальности
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |			УчебныйПланСпециальностиДисциплины.Ссылка КАК Ссылка
	               |		ИЗ
	               |			Документ.УчебныйПланСпециальности.Дисциплины КАК УчебныйПланСпециальностиДисциплины,
	               |			Константа.КонецУчебногоГода КАК КонецУчГода
	               |		ГДЕ
	               |			УчебныйПланСпециальностиДисциплины.Курс.КурсЧислом = КонецУчГода.Значение - УчебныйПланСпециальностиДисциплины.Ссылка.ГодНабора.ГодНабораЧислом
	               |			И УчебныйПланСпециальностиДисциплины.Кафедра.Принадлежность = ""Иностранный язык""
	               |			И УчебныйПланСпециальностиДисциплины.Дисциплина.ГруппаИспользования <> ""2ИнЯз"") КАК ПланыСИнЯзНаТекКурсе
	               |		ПО УчебныйПланСпециальности.Ссылка = ПланыСИнЯзНаТекКурсе.Ссылка";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	УчГод = Формат(Константы.НачалоУчебногоГода.Получить(), "ЧГ=0") + " - " + Формат(Константы.КонецУчебногоГода.Получить(), "ЧГ=0");
	Для Каждого СТЗ Из ТЗ Цикл
		План = Справочники.ПланыБезИностранногоЯзыка.СоздатьЭлемент();
		План.УчетныйНомерПлана = СТЗ.УчНомер;    
		План.Наименование = "" + СТЗ.Ссылка + ";" + УчГод;
		План.УчебныйГод = УчГод;
		План.ПланОбработан = Ложь;
		План.НаличиеДисциплинИЯ = ЗначениеЗаполнено(СТЗ.ИнЯз);
		План.Записать();
	КонецЦикла;
КонецПроцедуры