
&НаКлиенте
Процедура ОбновитьНомера(Команда)
	ПолучитьДанныеНаСервере();
	Сообщить("Загрузка закончена");
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеНаСервере()
	НомПоПор=0;
	МассивУчНомеровПлановБезДисциплин=Новый массив;
	МассивУчНомеровПланоСпециальностейСДисциплинами=ПолучитьМассивУчетныхНомеров();
	МассивУчНомеровПланоСпециальностейВсех=ПолучитьМассивУчетныхНомеровВсех();
	Для Каждого ЭлМассива Из   МассивУчНомеровПланоСпециальностейВсех  Цикл
		ТЗ=ПроцедурыИФункцииБГЭУ.ПолучитьСхемуДляКафедрИЯзНаСервере(ЭлМассива);
		Если ТЗ.Количество()=0 Тогда
			ОбСпрНовый=Справочники.ПланыБезИностранногоЯзыка.СоздатьЭлемент();
			ОбСпрНовый.УчетныйНомерПлана=ЭлМассива;
			ОбСпрНовый.Наименование=Строка(ЭлМассива)+";"+Формат(Константы.НачалоУчебногоГода.Получить(),"ЧГ=0")+" - "+Формат(Константы.КонецУчебногоГода.Получить(),"ЧГ=0");
			ОбСпрНовый.УчебныйГод=Формат(Константы.НачалоУчебногоГода.Получить(),"ЧГ=0")+" - "+Формат(Константы.КонецУчебногоГода.Получить(),"ЧГ=0");
			ОбСпрНовый.ПланОбработан=Ложь;
			ОбСпрНовый.НаличиеДисциплинИЯ=Ложь;
			ОбСпрНовый.Записать();
		Иначе
			ОбСпрНовый.УчетныйНомерПлана=ЭлМассива;
			ОбСпрНовый=Справочники.ПланыБезИностранногоЯзыка.СоздатьЭлемент();
			ОбСпрНовый.Наименование=Строка(ЭлМассива)+";"+Формат(Константы.НачалоУчебногоГода.Получить(),"ЧГ=0")+" - "+Формат(Константы.КонецУчебногоГода.Получить(),"ЧГ=0");
			ОбСпрНовый.УчебныйГод=Формат(Константы.НачалоУчебногоГода.Получить(),"ЧГ=0")+" - "+Формат(Константы.КонецУчебногоГода.Получить(),"ЧГ=0");
			ОбСпрНовый.ПланОбработан=Ложь;
			ОбСпрНовый.НаличиеДисциплинИЯ=Истина;
			ОбСпрНовый.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция  ПолучитьМассивУчетныхНомеровВсех()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчебныйПланСпециальности.УчетныйНомер КАК УчетныйНомер
		|ИЗ
		|	Документ.УчебныйПланСпециальности КАК УчебныйПланСпециальности";
	
	ТЗ_РезультатЗапроса=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УчетныйНомер");
	
	 Возврат  ТЗ_РезультатЗапроса;
КонецФункции


&НаСервере
Функция  ПолучитьМассивУчетныхНомеров()
	   УчетныйНомер="";
	   Запрос=Новый Запрос;
	   Запрос.Текст=
	  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	  |	УчебныйПланСпециальностиДисциплины.Ссылка.УчетныйНомер КАК УчетныйНомер,
	  |	УчебныйПланСпециальностиДисциплины.Ссылка.Ссылка КАК Ссылка,
	  |	УчебныйПланСпециальностиДисциплины.Курс.КурсЧислом КАК КурсКурсЧислом,
	  |	УчебныйПланСпециальностиДисциплины.Курс КАК Курс,
	  |	УчебныйПланСпециальности.Ссылка КАК СсылкаИзПлана
	  |ПОМЕСТИТЬ Данные
	  |ИЗ
	  |	Документ.УчебныйПланСпециальности КАК УчебныйПланСпециальности
	  |		ПОЛНОЕ СОЕДИНЕНИЕ Документ.УчебныйПланСпециальности.Дисциплины КАК УчебныйПланСпециальностиДисциплины
	  |		ПО УчебныйПланСпециальности.Ссылка = УчебныйПланСпециальностиДисциплины.Ссылка
	  |ГДЕ
	  |	УчебныйПланСпециальностиДисциплины.Кафедра.Принадлежность = ""Иностранный язык""
	  |	И УчебныйПланСпециальностиДисциплины.Дисциплина.ГруппаИспользования <> ""2ИнЯз""
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	КонецУчебногоГода.Значение - УчебныйПланСпециальности.ГодНабора.ГодНабораЧислом КАК ТекущКурс,
	  |	УчебныйПланСпециальности.Ссылка КАК Ссылка
	  |ПОМЕСТИТЬ ТекущиеКурсы
	  |ИЗ
	  |	Документ.УчебныйПланСпециальности КАК УчебныйПланСпециальности,
	  |	Константа.КонецУчебногоГода КАК КонецУчебногоГода
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ РАЗЛИЧНЫЕ
	  |	Данные.УчетныйНомер КАК УчетныйНомер,
	  |	ТекущиеКурсы.ТекущКурс КАК ТекущКурс
	  |ИЗ
	  |	Данные КАК Данные
	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТекущиеКурсы КАК ТекущиеКурсы
	  |		ПО (ТекущиеКурсы.Ссылка = Данные.Ссылка)
	  |			И (ТекущиеКурсы.ТекущКурс = Данные.КурсКурсЧислом)";
	  //Запрос.УстановитьПараметр("УчетныйНомерПлана",Справочники.УчетныеНомераПлановСпециальностей.НайтиПоНаименованию("21ЗГС0/"));
	  Запрос.УстановитьПараметр("УчетныйНомер",УчетныйНомер);

	  ТЗ_РезультатЗапроса=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УчетныйНомер");
	  Возврат ТЗ_РезультатЗапроса;

	
КонецФункции