// Работа с файлами
&НаСервереБезКонтекста
Процедура ЗаписатьФайл(Путь, ТЗ)
	Файл = Новый ЗаписьТекста(Путь);
	Колонки = ТЗ.Колонки;
	Для Каждого СТЗ из ТЗ Цикл
		Стр = "";
		Для Каждого Колонка Из Колонки Цикл
			Стр = Стр + ";" + СТЗ[Колонка.Имя];
		КонецЦикла;
		Файл.ЗаписатьСтроку(Стр);
	КонецЦикла;
	Файл.Закрыть();
КонецПроцедуры

// Какие-то вспомогательные функции
&НаСервереБезКонтекста
Функция ПривестиРУВД(Текст)
	Текст = ТРег(ОбщиеФункции.СжПробелы(Текст));
	Текст = СтрЗаменить(Текст, "Г.", "г.");
	Текст = СтрЗаменить(Текст, "Обл", "обл");
	Текст = СтрЗаменить(Текст, "Рувд", "РУВД");
	Текст = СтрЗаменить(Текст, "Ровд", "РОВД");
	Текст = СтрЗаменить(Текст, "Увд", "УВД");
	Возврат ОбщиеФункции.СжПробелы(Текст);
КонецФункции

&НаСервереБезКонтекста
Функция Норм(Текст)
	Предложения = СтрРазделить(Текст, ".", Ложь);
	Для Инд = 0 По Предложения.ВГраница() Цикл
		Предложения[Инд] = ОбщиеФункции.СжПробелы(Предложения[Инд]);
		Длинна = СтрДлина(Предложения[Инд]);
		Предложения[Инд] = Врег(Лев(Предложения[Инд], 1)) + Нрег(Прав(Предложения[Инд], Длинна - 1));
	КонецЦикла;
	РезТекст = СтрСоединить(Предложения, ". ");
	Возврат ОбщиеФункции.СжПробелы(РезТекст);
	// Функция для перевода галимого текста в норм вид
КонецФункции

// Правим справочники
&НаСервереБезКонтекста
Процедура ИсправитьСотрудниковНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СТЗ Из ТЗ Цикл
		Сотрудник = СТЗ.Ссылка.ПолучитьОбъект();
		Сотрудник.Фамилия = ТРег(ОбщиеФункции.СжПробелы(Сотрудник.Фамилия));
		Сотрудник.Имя = ТРег(ОбщиеФункции.СжПробелы(Сотрудник.Имя));
		Сотрудник.Отчество = ТРег(ОбщиеФункции.СжПробелы(Сотрудник.Отчество));
		
		Наимен = Сотрудник.Фамилия + " " + Сотрудник.Имя + " " + Сотрудник.Отчество;
		Сотрудник.Наименование = ТРег(ОбщиеФункции.СжПробелы(Наимен));
		Сотрудник.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьСотрудников(Команда)
	ИсправитьСотрудниковНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИсправитьПодразделенияНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Подразделение.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Подразделение КАК Подразделение";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СТЗ Из ТЗ Цикл
		Подразделение = СТЗ.Ссылка.ПолучитьОбъект();
		Подразделение.Наименование = Норм(Подразделение.Наименование);
		Подразделение.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьПодразделения(Команда)
	ИсправитьПодразделенияНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИсправитьДолжностиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Должность.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Должность КАК Должность";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СТЗ Из ТЗ Цикл
		Должность = СТЗ.Ссылка.ПолучитьОбъект();
		Должность.Наименование = Норм(Должность.Наименование);
		Должность.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьДолжности(Команда)
	ИсправитьДолжностиНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура CheckНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники";
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СТЗ Из ТЗ Цикл
		Сотрудник = СТЗ.Ссылка.ПолучитьОбъект();
		Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию("").ПолучитьОбъект();
		Если Сотрудник.ОсновноеМестоРаботы.Количество() > 1 Тогда
			Сообщить(Сотрудник.Наименование);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Check(Команда)
	CheckНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтраховкиНаСервере()
	ТабЗначений = Новый ТаблицаЗначений;    
	ПоследняяСтрока = Таб.ВысотаТаблицы;
	ПоследняяКолонка = Таб.ШиринаТаблицы;
	ОбластьЯчеек = Таб.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка);	
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	ТЗ = ПостроительОтчета.Результат.Выгрузить();
	
	НеНайдены = Новый ТаблицаЗначений;
	НеНайдены.Колонки.Добавить("ФИО");
	Проблемы = Новый ТаблицаЗначений;
	Проблемы.Колонки.Добавить("ФИО");
	Проблемы.Колонки.Добавить("ТипПроб");
	Проблемы.Колонки.Добавить("ИзОбъекта");
	Проблемы.Колонки.Добавить("ИзФайла");
	
	Для Каждого СТЗ Из ТЗ Цикл
		ФИО = ОбщиеФункции.СжПробелы(СТЗ.ФИО);
		Сотрудник = Справочники.СтудентыБГЭУ.НайтиПоНаименованию(ФИО, Истина);
		Если Сотрудник.Пустая() Тогда
			Чел = НеНайдены.Добавить();
			Чел.ФИО = ФИО;
			Сообщить(ФИО);
			Продолжить;
		КонецЕсли;
		оСотр = Сотрудник.ПолучитьОбъект();	

		Попытка
			ДатаВыдачи = Дата(СТЗ.ДатаВыдачи + " 00:00:00");
		Исключение
			ДатаВыдачи = Дата(1,1,1);
		КонецПопытки;
		Попытка
			Начало = Дата(СТЗ.Начало + " 00:00:00");
		Исключение
			Начало = Дата(1,1,1);
		КонецПопытки;
		Попытка
			Окончание = Дата(СТЗ.Окончание + " 00:00:00");
		Исключение
			Окончание = Дата(1,1,1);
		КонецПопытки;
		
		Попытка
			НоваяСтраховка = оСотр.Страховка.Добавить();
			НоваяСтраховка.ДатаВыдачи = ДатаВыдачи;
			НоваяСтраховка.НачалоДействия = Начало;
			НоваяСтраховка.КонецДействия = Окончание;
			НоваяСтраховка.НаименованиеСтрахКомпании = ТРег(ОбщиеФункции.СжПробелы(СТЗ.Компания));
			НоваяСтраховка.НомерСтраховки = ВРег(ОбщиеФункции.СжПробелы(СТЗ.НомерСтрах));
		Исключение
			Проблема = Проблемы.Добавить();
			Проблема.ФИО = ФИО;
		КонецПопытки;
		
		Если оСотр.Группа.Наименование <> СТЗ.Группа Тогда
			Проблема = Проблемы.Добавить();
			Проблема.ФИО = ФИО;
			Проблема.ТипПроб = "Группа";
			Проблема.ИзОбъекта = оСотр.Группа.Наименование;
			Проблема.ИзФайла = СТЗ.Группа;
		КонецЕсли;
		Если оСотр.НомерЗачетнойКнижки <> СТЗ.Зачетка Тогда
			Проблема = Проблемы.Добавить();
			Проблема.ФИО = ФИО;
			Проблема.ТипПроб = "Зачетка";
			Проблема.ИзОбъекта = оСотр.НомерЗачетнойКнижки;
			Проблема.ИзФайла = СТЗ.Зачетка;
		КонецЕсли;

		оСотр.Записать();
	КонецЦикла;
	Остановка = Проблемы;
	Остановка2 = НеНайдены;
	ЗаписатьФайл("C:\22_04\СтраховкиПроблемы.txt", Проблемы);
	ЗаписатьФайл("C:\22_04\СтраховкиНеНайдены.txt", НеНайдены);
КонецПроцедуры

&НаКлиенте
Процедура Страховки(Команда)
	СтраховкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура РегистрацияНаСервере()
	ТабЗначений = Новый ТаблицаЗначений;    
	ПоследняяСтрока = Таб.ВысотаТаблицы;
	ПоследняяКолонка = Таб.ШиринаТаблицы;
	ОбластьЯчеек = Таб.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка);	
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	ТЗ = ПостроительОтчета.Результат.Выгрузить();
	
	НеНайдены = Новый ТаблицаЗначений;
	НеНайдены.Колонки.Добавить("ФИО");
	
	Проблемы = Новый ТаблицаЗначений;
	Проблемы.Колонки.Добавить("ФИО");
	Проблемы.Колонки.Добавить("ТипПроб");
	Проблемы.Колонки.Добавить("ИзОбъекта");
	Проблемы.Колонки.Добавить("ИзФайла");
	
	Для Каждого СТЗ Из ТЗ Цикл
		ФИО = ОбщиеФункции.СжПробелы(СТЗ.ФИО);
		Сотрудник = Справочники.СтудентыБГЭУ.НайтиПоНаименованию(ФИО, Истина);
		Если Сотрудник.Пустая() Тогда
			Чел = НеНайдены.Добавить();
			Чел.ФИО = ФИО;
			Сообщить(ФИО);
			Продолжить;
		КонецЕсли;
		оСотр = Сотрудник.ПолучитьОбъект();	

		Попытка
			Начало = Дата(СТЗ.Начало + " 00:00:00");
		Исключение
			Начало = Дата(1,1,1);
		КонецПопытки;
		Попытка
			Окончание = Дата(СТЗ.Окончание + " 00:00:00");
		Исключение
			Окончание = Дата(1,1,1);
		КонецПопытки;
		
		Попытка
			НоваяРегистрация = оСотр.Регистрация.Добавить();
			НоваяРегистрация.ДатаВыдачи = Дата(1,1,1);
			НоваяРегистрация.КонецДействия = Окончание;
			НоваяРегистрация.НачалоДействия = Начало;
			НоваяРегистрация.Номер = ОбщиеФункции.СжПробелы(СТЗ.НомерВизы);
			НоваяРегистрация.ТипРегистрации = НРег(ОбщиеФункции.СжПробелы(СТЗ.ТипРегистрации));
		Исключение
			Проблема = Проблемы.Добавить();
			Проблема.ФИО = ФИО;
		КонецПопытки;
		
		Если оСотр.Группа.Наименование <> СТЗ.Группа Тогда
			Проблема = Проблемы.Добавить();
			Проблема.ФИО = ФИО;
			Проблема.ТипПроб = "Группа";
			Проблема.ИзОбъекта = оСотр.Группа.Наименование;
			Проблема.ИзФайла = СТЗ.Группа;
		КонецЕсли;
		оСотр.Записать();
	КонецЦикла;
	Остановка = Проблемы;
	Остановка2 = НеНайдены;
	ЗаписатьФайл("C:\22_04\РегистрацияПроблемы.txt", Проблемы);
	ЗаписатьФайл("C:\22_04\РегистрацияНеНайдены.txt", НеНайдены);
КонецПроцедуры

&НаКлиенте
Процедура Регистрация(Команда)
	РегистрацияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВизаНаСервере()
	ТабЗначений = Новый ТаблицаЗначений;    
	ПоследняяСтрока = Таб.ВысотаТаблицы;
	ПоследняяКолонка = Таб.ШиринаТаблицы;
	ОбластьЯчеек = Таб.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка);	
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	ТЗ = ПостроительОтчета.Результат.Выгрузить();
	
	НеНайдены = Новый ТаблицаЗначений;
	НеНайдены.Колонки.Добавить("ФИО");
	
	Проблемы = Новый ТаблицаЗначений;
	Проблемы.Колонки.Добавить("ФИО");
	Проблемы.Колонки.Добавить("ТипПроб");
	Проблемы.Колонки.Добавить("ИзОбъекта");
	Проблемы.Колонки.Добавить("ИзФайла");
	
	Для Каждого СТЗ Из ТЗ Цикл
		ФИО = ОбщиеФункции.СжПробелы(СТЗ.ФИО);
		Сотрудник = Справочники.СтудентыБГЭУ.НайтиПоНаименованию(ФИО, Истина);
		Если Сотрудник.Пустая() Тогда
			Чел = НеНайдены.Добавить();
			Чел.ФИО = ФИО;
			Сообщить(ФИО);
			Продолжить;
		КонецЕсли;
		оСотр = Сотрудник.ПолучитьОбъект();	
		
		Попытка
			ДатаВыдачи = Дата(СТЗ.ДатаВыдачи + " 00:00:00");
		Исключение
			ДатаВыдачи = Дата(1,1,1);
		КонецПопытки;
		Попытка
			Начало = Дата(СТЗ.Начало + " 00:00:00");
		Исключение
			Начало = Дата(1,1,1);
		КонецПопытки;
		Попытка
			Окончание = Дата(СТЗ.Окончание + " 00:00:00");
		Исключение
			Окончание = Дата(1,1,1);
		КонецПопытки;
		
		Попытка
			НоваяВиза = оСотр.Виза.Добавить();
			НоваяВиза.ДатаВыдачи = ДатаВыдачи;
			НоваяВиза.КонецДействия = Окончание; 
			НоваяВиза.НачалоДействия = Начало;
			НоваяВиза.НомерВизы = ОбщиеФункции.СжПробелы(СТЗ.НомерВизы);
			НоваяВиза.ТипВизы = ОбщиеФункции.СжПробелы(СТЗ.ТипВизы);
		Исключение
			Проблема = Проблемы.Добавить();
			Проблема.ФИО = ФИО;
		КонецПопытки;
		
		Если оСотр.Группа.Наименование <> СТЗ.Группа Тогда
			Проблема = Проблемы.Добавить();
			Проблема.ФИО = ФИО;
			Проблема.ТипПроб = "Группа";
			Проблема.ИзОбъекта = оСотр.Группа.Наименование;
			Проблема.ИзФайла = СТЗ.Группа;
		КонецЕсли;
		Если оСотр.НомерЗачетнойКнижки <> СТЗ.Зачетка Тогда
			Проблема = Проблемы.Добавить();
			Проблема.ФИО = ФИО;
			Проблема.ТипПроб = "Зачетка";
			Проблема.ИзОбъекта = оСотр.НомерЗачетнойКнижки;
			Проблема.ИзФайла = СТЗ.Зачетка;
		КонецЕсли;;
		оСотр.Записать();
	КонецЦикла;
	Остановка = Проблемы;
	Остановка2 = НеНайдены;
	ЗаписатьФайл("C:\22_04\ВизыПроблемы.txt", Проблемы);
	ЗаписатьФайл("C:\22_04\ВизыНеНайдены.txt", НеНайдены);
КонецПроцедуры

&НаКлиенте
Процедура Виза(Команда)
	ВизаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбразованиеНаСервере()
	ТабЗначений = Новый ТаблицаЗначений;    
	ПоследняяСтрока = Таб.ВысотаТаблицы;
	ПоследняяКолонка = Таб.ШиринаТаблицы;
	ОбластьЯчеек = Таб.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка);	
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	ТЗ = ПостроительОтчета.Результат.Выгрузить();
	
	НеНайдены = Новый ТаблицаЗначений;
	НеНайдены.Колонки.Добавить("ФИО");

	Проблемы = Новый ТаблицаЗначений;
	Проблемы.Колонки.Добавить("ФИО");
	Проблемы.Колонки.Добавить("ТипПроб");
	Проблемы.Колонки.Добавить("ИзОбъекта");
	Проблемы.Колонки.Добавить("ИзФайла");
	
	Для Каждого СТЗ Из ТЗ Цикл
		ФИО = ОбщиеФункции.СжПробелы(СТЗ.Фамилия + " " + СТЗ.Имя + " " + СТЗ.Отчество);
		Студент = Справочники.СтудентыБГЭУ.НайтиПоНаименованию(ФИО, Истина);
		Если Студент.Пустая() Тогда
			Чел = НеНайдены.Добавить();
			Чел.ФИО = ФИО;
			Продолжить;	
		КонецЕсли;
		
		оСтуд = Студент.ПолучитьОбъект();
		Попытка
			Если ВРег(ОбщиеФункции.СжПробелы(СТЗ.Зачетка)) <> оСтуд.НомерЗачетнойКнижки Тогда
				Проблема = Проблемы.Добавить();
				Проблема.ФИО = ФИО;
				Проблема.ТипПроб = "Зачетка";
				Проблема.ИзОбъекта = оСтуд.НомерЗачетнойКнижки;
				Проблема.ИзФайла = СТЗ.Зачетка;
			КонецЕсли;
			оСтуд.НачальноеОбразование = ОбщиеФункции.СжПробелы(СТЗ.Школа);
			оСтуд.ЧтоОкончил = ОбщиеФункции.СжПробелы(СТЗ.Школа);
			Попытка 
				оСтуд.КогдаОкончил = Число(СТЗ.ГодОкончания);
			Исключение
			КонецПопытки;
			
			
			Уровень = ОбщиеФункции.СжПробелы(СТЗ.Уровень);
			Если Уровень = "общее среднее" Или Уровень = "профессионально-техническое" Или Уровень = "высшее" Тогда
				оСтуд.УровеньОбразования = Уровень;	
			ИначеЕсли Уровень = "среднее специальное" Тогда
				оСтуд.УровеньОбразования = "среднее-специальное";
			КонецЕсли;
			оСтуд.Медаль = ОбщиеФункции.СжПробелы(СТЗ.Медаль);
			оСтуд.Записать();
		Исключение
			Сообщить("Иисключение!!! " + ФИО);
		КонецПопытки;
	КонецЦикла;
	Остановка = Проблемы;
	ЗаписатьФайл("C:\22_04\ОбразованиеПроблемы.txt", Проблемы);
	ЗаписатьФайл("C:\22_04\ОбразованиеНеНайдены.txt", НеНайдены);
КонецПроцедуры

&НаКлиенте
Процедура Образование(Команда)
	ОбразованиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрактыНаСервере()
	ТабЗначений = Новый ТаблицаЗначений;    
	ПоследняяСтрока = Таб.ВысотаТаблицы;
	ПоследняяКолонка = Таб.ШиринаТаблицы;
	ОбластьЯчеек = Таб.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка);	
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	ТЗ = ПостроительОтчета.Результат.Выгрузить();
	
	НеНайдены = Новый ТаблицаЗначений;
	НеНайдены.Колонки.Добавить("ФИО");
	Проблемы = Новый ТаблицаЗначений;
	Проблемы.Колонки.Добавить("ФИО");
	Проблемы.Колонки.Добавить("ТипПроб");
	Проблемы.Колонки.Добавить("ИзОбъекта");
	Проблемы.Колонки.Добавить("ИзФайла");
	
	Для Каждого СТЗ Из ТЗ Цикл
		ФИО = ОбщиеФункции.СжПробелы(СТЗ.Фамилия + " " + СТЗ.Имя + " " + СТЗ.Отчество);
		Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ФИО, Истина);
		Если Сотрудник.Пустая() Тогда
			Чел = НеНайдены.Добавить();
			Чел.ФИО = ФИО;
			Сообщить(ФИО);
			Продолжить;
		КонецЕсли;
		оСотр = Сотрудник.ПолучитьОбъект();	

		Попытка
			ДатаНачала = Дата(СТЗ.ДатаНачала + " 00:00:00");
		Исключение
			ДатаНачала = Дата(1,1,1);
		КонецПопытки;
		Попытка
			ДатаОкончания = Дата(СТЗ.ДатаОкончания + " 00:00:00");
		Исключение
			ДатаОкончания = Дата(1,1,1);
		КонецПопытки;
		
		
		Если СТЗ.ТипДоговора = "Основное место работы" Тогда
			НовРабота = оСотр.ОсновноеМестоРаботы.Добавить();
			НовРабота.ДатаПриема = ДатаНачала;
			НовРабота.ДатаПо = ДатаОкончания;
			НовРабота.ВидТрудовогоДоговора = "контракт";
			Попытка
				НовРабота.Ставка = Число(СТЗ.Ставка);
				оСотр.Ставка = Число(СТЗ.Ставка);
			Исключение
			КонецПопытки;
			
			Если СТЗ.Номер <> "" Тогда
				НовРабота.Примечание = ВРег(ОбщиеФункции.СжПробелы(СТЗ.Номер));	
			КонецЕсли;
			
			Должность = Норм(ОбщиеФункции.СжПробелы(СТЗ.Должность));
			Подразделение = Норм(ОбщиеФункции.СжПробелы(СТЗ.Подразделение));
			
			спДолжн = Справочники.Должность.НайтиПоНаименованию(Должность, Истина);
			спПодр = Справочники.Подразделение.НайтиПоНаименованию(Подразделение, Истина);
			Если спДолжн = Неопределено Тогда
				Проблема = Проблемы.Добавить();
				Проблема.ФИО = ФИО;
				Проблема.ТипПроб = "Должность";
			    Проблема.ИзОбъекта = оСотр.Должность.Наименование;
				Проблема.ИзФайла = Должность;
			КонецЕсли;
			Если спПодр = Неопределено Тогда
				Проблема = Проблемы.Добавить();
				Проблема.ФИО = ФИО;
				Проблема.ТипПроб = "Подразделение";
			    Проблема.ИзОбъекта = оСотр.Подразделение.Наименование;
				Проблема.ИзФайла = Подразделение;
			КонецЕсли;
			НовРабота.ДолжностьСотрудника = спДолжн;
			НовРабота.Подразделение = спПодр;
			оСотр.Должность = спДолжн;
			оСотр.Подразделение = спПодр;
		КонецЕсли;
		оСотр.Записать();
	КонецЦикла;
	Остановка = Проблемы;
	Остановка2 = НеНайдены;
	ЗаписатьФайл("C:\22_04\КонтрактыПроблемы.txt", Проблемы);
	ЗаписатьФайл("C:\22_04\КонтрактыНеНайдены.txt", НеНайдены);
КонецПроцедуры

&НаКлиенте
Процедура Контракты(Команда)
	КонтрактыНаСервере();
КонецПроцедуры

&НаСервере
Процедура emailНаСервере()
	ТабЗначений = Новый ТаблицаЗначений;    
	ПоследняяСтрока = Таб.ВысотаТаблицы;
	ПоследняяКолонка = Таб.ШиринаТаблицы;
	ОбластьЯчеек = Таб.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка);	
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);  
	ПостроительОтчета = Новый ПостроительОтчета; 
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	ТЗ = ПостроительОтчета.Результат.Выгрузить();
	
	НеНайдены = Новый ТаблицаЗначений;
	НеНайдены.Колонки.Добавить("ФИО");
	
	Для Каждого СТЗ Из ТЗ Цикл
		ФИО = ОбщиеФункции.СжПробелы(СТЗ.ФИО);
		Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ФИО, Истина);
		Если Сотрудник.Пустая() Тогда
			Сот = НеНайдены.Добавить();
			Сот.ФИО = ФИО;
			Продолжить;
		КонецЕсли;
		
		оСотр = Сотрудник.ПолучитьОбъект();
		
		// Просклонять
		// По полям разбить
		
		//оСотр.Записать();
	КонецЦикла;
	
	Остановка = НеНайдены;
	ЗаписатьФайл("C:\1\НеНайдены.txt", НеНайдены);
КонецПроцедуры

&НаКлиенте
Процедура email(Команда)
	emailНаСервере();
КонецПроцедуры
