&НаКлиенте
Процедура ДисциплиныПриИзменении(Элемент)   
	Если Элементы.ИтогиСеместры.Видимость = Истина Тогда
		Если Объект.ФормаОбучения = ПредопределенноеЗначение("Перечисление.ФормаОбучения.ДневнаяФО")
			или Объект.ФормаОбучения = ПредопределенноеЗначение("Перечисление.ФормаОбучения.МагистратураДневФорма") 
			или Объект.ФормаОбучения = ПредопределенноеЗначение("Перечисление.ФормаОбучения.МагистратураИнГраждане")
			или Объект.ФормаОбучения = ПредопределенноеЗначение("Перечисление.ФормаОбучения.ИИТ_ВФО")
			или Объект.ФормаОбучения = ПредопределенноеЗначение("Перечисление.ФормаОбучения.ИностранныеГраждане") Тогда
			ВывестиИтогиНаСервере();
		Иначе 
			ВывестиИтогиЗФОНаСервере();
		КонецЕсли;
	КонецЕсли;
	Если Объект.ФормаОбучения = ПредопределенноеЗначение("Перечисление.ФормаОбучения.ЗаочнаяФО") Тогда
		ПометитьСтрокуДляОкрасаЗаочнаяФО();
	КонецЕсли;
	Если Объект.ФормаОбучения = ПредопределенноеЗначение("Перечисление.ФормаОбучения.ДневнаяФО") Тогда
		ПометитьСтрокуДляОкрасаДневаняФО();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДисциплиныДисциплинаПриИзменении(Элемент)
	Строка = Элементы.Дисциплины.ТекущиеДанные;
	Строка.ВыбираемыеДисциплины = Строка(Строка.Дисциплина);
	Строка.ДляДисциплины = ПроверитьДисциплинуНаНаличие(Объект.ФормаОбучения, Строка.ВыбираемыеДисциплины);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораДисциплин(Значение, ДопПараметры) Экспорт
    Если Значение = Неопределено Тогда
        Возврат;
	КонецЕсли;
	Модифицированность = Истина;
	Элементы.Дисциплины.ТекущиеДанные.ВыбираемыеДисциплины = Значение.Дисциплины; 
	Элементы.Дисциплины.ТекущиеДанные.ВыбираемыеКафедры = Значение.Кафедры;
	Элементы.Дисциплины.ТекущиеДанные.ВыборДисциплины = Истина;
	Элементы.Дисциплины.ТекущиеДанные.Дисциплина = "";
	Элементы.Дисциплины.ТекущиеДанные.Кафедра = "";
	Элементы.Дисциплины.ТекущиеДанные.ДляДисциплины = "0";
КонецПроцедуры

&НаКлиенте
Процедура ДисциплиныВыбираемыеДисциплигныОчистка(Элемент, СтандартнаяОбработка)
	Строка = Элементы.Дисциплины.ТекущиеДанные;
	Если Строка.ВыборДисциплины = Истина Тогда
		Строка.ВыбираемыеКафедры = "";
		Строка.ВыборДисциплины = Ложь;
		Строка.ДляДисциплины = "0";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ЭтаФорма.Прочитать();
	ПометитьКомпетенцииДляОкраса();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКомпетенции(Команда)
	Если Элементы.Найти("ФормаПоказатьКомпетенции").Заголовок = "Показать компетенции" Тогда
		Элементы.Найти("Компетенции").Видимость = Истина;
		Элементы.Найти("КомпетенцииДисциплины").Видимость = Истина;
		Элементы.Найти("НаименованиеНомерДисциплины").Видимость = Истина;
		Элементы.Найти("ПримечанияКПлану").Видимость = Ложь;
		Элементы.Найти("КомпетенцииМодулей").Видимость = Ложь;
		Элементы.Найти("ФормаПоказатьКомпетенции").Заголовок = "Скрыть компетенции";
		ПометитьКомпетенцииДляОкраса();
	Иначе
		Элементы.Найти("Компетенции").Видимость = Ложь;
		Элементы.Найти("ФормаПоказатьКомпетенции").Заголовок = "Показать компетенции"
	КонецЕсли;
КонецПроцедуры