// Процедура осуществляет выгрузку данных выбранного документа из 1С в XML используя запись сообщения обмена (XML Writer)
Процедура XML_Импорт(Кнопка)
	// Проверить выбор пользователя. Поле Документ ДОЛЖНО быть заполнено
	Если НЕ ЗначениеЗаполнено(ДокументОбъект) Тогда
		Предупреждение("Нужно выбрать документ.");
		Возврат;
	КонецЕсли;
	
	// Проверить выбор пользователя. Поле Имя файла ДОЛЖНО быть заполнено
 	Если ПустаяСтрока(ИмяФайла) Тогда
		Предупреждение("Укажите файл данных XML для выгрузки.");
		Возврат;
	КонецЕсли;
	
	// Проверить возможность перезаписи текста
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда
		Ответ = Вопрос("Файл " + ИмяФайла + " существует. Заменить?",РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Сообщить("Сохранение отменено.");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Записать данные документа в XML используя последовательный доступ к тексту и XML сериализацию
	ТекстФайл = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8);
	
	// Преобразовать данные документа в формат XML страндарными средствами платформы 1С
    ЗаписьXML = Новый ЗаписьXML;
    ЗаписьXML.УстановитьСтроку();
    ЗаписатьXML(ЗаписьXML, ДокументОбъект.ПолучитьОбъект());
	
	// Сохранить полученные XML Данные в текстовый документ
	ТекстФайл.Записать(ЗаписьXML.Закрыть());
	ТекстФайл.Закрыть();
КонецПроцедуры

Процедура XML_Экспорт(Кнопка)
	// Проверить выбор пользователя. Поле Имя файла ДОЛЖНО быть заполнено
	Если ПустаяСтрока(ИмяФайла) Тогда
		Предупреждение("Укажите файл данных XML для загрузки!");
		Возврат;
	КонецЕсли;
	
	// Проверка возможности чтения XML файла
	Файл = Новый Файл(ИмяФайла);
	Если Не Файл.Существует() Тогда
		Предупреждение("Указанный Вами файл " + ИмяФайла + " не найден!");
		Возврат;
	КонецЕсли;
	
	// Прочитать XML файл используя стандартные средства платформы 1С XML Reader
	Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяФайла);
	    НовыйОбъект = ПрочитатьXML(ЧтениеXML);
		ДокументОбъект = НовыйОбъект.Ссылка; 
		Документ = НовыйОбъект.ПолучитьФорму();
		Документ.Открыть();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
КонецПроцедуры

Процедура ИмяФайлаНачалоВыбора(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		
	ДиалогОткрытияФайла.Заголовок = "Выберите XML файл данных документа.";
	ДиалогОткрытияФайла.Фильтр =  "Tекст(*.xml)|*.xml";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.ПолноеИмяФайла = ИмяФайла;
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

Процедура ПриОткрытии()
	// Имя XLM файла по умолчанию
	ИмяФайла = "C:\1C\документ.xml";
КонецПроцедуры


