&НаСервере
// Процедура сохраняет Таблицу значений в Excel файл (xlsx).
//
// Параметры:
//  ТЗ - Таблица значений - данные, которые будут записаны в файл.
//  ПутьКФайлу - Строка - полный путь к файлу (с расширением xlsx).
//
Процедура ЗаписатьТаблицуЗначенийВExcel(ТЗ, ПутьКФайлу) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	Заголовки = Новый Структура;
	ОбластьВывода = ТабДок.ПолучитьОбласть(1, 1, 1, ТЗ.Колонки.Количество());
	
	// Описываем заполнение всех колонок как "Параметр"
	Для Инд = 1 По ТЗ.Колонки.Количество() Цикл
	    Ячейка = ОбластьВывода.Область(1, Инд, 1, Инд);
	    Ячейка.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
		// Заполняем структуру заголовков таблицы
		Колонка = ТЗ.Колонки[Инд - 1];
		Ячейка.Параметр = Колонка.Имя;
	    Заголовки.Вставить(Колонка.Имя, Колонка.Имя);
	КонецЦикла;
	
	// Заполняем заголовки и данные в табличном документе
	ОбластьВывода.Параметры.Заполнить(Заголовки);
	ТабДок.Вывести(ОбластьВывода);
	Для Каждого СТЗ Из ТЗ Цикл
		ОбластьВывода.Параметры.Заполнить(СТЗ);
		ТабДок.Вывести(ОбластьВывода);
	КонецЦикла;
	
	ТабДок.Записать(ПутьКФайлу, ТипФайлаТабличногоДокумента.XLSX);	
КонецПроцедуры

Функция ОбменСотрудникамиСОтделомКадров(Путь) Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорПриложениеКДоговору.ФормаОбучения КАК ФормаОбучения,
	               |	ДоговорПриложениеКДоговору.Ссылка.ФИО.KODOK КАК КодСотрудника,
	               |	ДоговорПриложениеКДоговору.Ссылка.НомерДоговораСоставной КАК НомерДоговораСоставной,
	               |	ДоговорПриложениеКДоговору.Ссылка.ДатаС КАК ДатаС,
	               |	ДоговорПриложениеКДоговору.Ссылка.ДатаПО КАК ДатаПО,
	               |	ДоговорПриложениеКДоговору.Ссылка.ФИО КАК ФИО,
	               |	ДоговорПриложениеКДоговору.Ссылка.УчСтепень КАК УчСтепень,
	               |	ДоговорПриложениеКДоговору.Ссылка.УченЗвание КАК УченЗвание,
	               |	ДоговорПриложениеКДоговору.Ссылка.Кафедра КАК Кафедра,
	               |	ДоговорПриложениеКДоговору.Ссылка.ЧасовПоДоговору КАК ЧасовПоДоговору,
	               |	ДоговорПриложениеКДоговору.Дисциплина КАК Дисциплина,
	               |	ДоговорПриложениеКДоговору.НомераГрупп КАК НомераГрупп,
	               |	ДоговорПриложениеКДоговору.НомерДоговора КАК НомерДоговора,
	               |	ДоговорПриложениеКДоговору.ЛекцииУст КАК ЛекцииУст,
	               |	ДоговорПриложениеКДоговору.ПЗУст КАК ПЗУст,
	               |	ДоговорПриложениеКДоговору.ЛБУст КАК ЛБУст,
	               |	ДоговорПриложениеКДоговору.Лекции КАК Лекции,
	               |	ДоговорПриложениеКДоговору.ПЗ КАК ПЗ,
	               |	ДоговорПриложениеКДоговору.ЛБ КАК ЛБ,
	               |	ДоговорПриложениеКДоговору.ИПР КАК ИПР,
	               |	ДоговорПриложениеКДоговору.КСР КАК КСР,
	               |	ДоговорПриложениеКДоговору.КонтрРаб КАК КонтрРаб,
	               |	ДоговорПриложениеКДоговору.КП КАК КП,
	               |	ДоговорПриложениеКДоговору.КР КАК КР,
	               |	ДоговорПриложениеКДоговору.ТР КАК ТР,
	               |	ДоговорПриложениеКДоговору.РР КАК РР,
	               |	ДоговорПриложениеКДоговору.Консульт КАК Консульт,
	               |	ДоговорПриложениеКДоговору.Зач КАК Зач,
	               |	ДоговорПриложениеКДоговору.Экз КАК Экз,
	               |	ДоговорПриложениеКДоговору.ДПиГЭК КАК ДПиГЭК,
	               |	ДоговорПриложениеКДоговору.Практики КАК Практики,
	               |	ДоговорПриложениеКДоговору.Всего КАК Всего,
	               |	ДоговорПриложениеКДоговору.Ссылка.СтоимостьЧаса КАК СтоимостьЧаса,
	               |	ДоговорПриложениеКДоговору.Ссылка.СуммаПоДоговору КАК СуммаПоДоговору
	               |ИЗ
	               |	Документ.Договор.ПриложениеКДоговору КАК ДоговорПриложениеКДоговору
	               |ГДЕ
	               |	ДоговорПриложениеКДоговору.Ссылка.ВидРаботы.Наименование <> ""Акты иностран. маг. руков.""
	               |	И ДоговорПриложениеКДоговору.Ссылка.ВидРаботы.Наименование <> ""Акты иностран. маг. руков. ЗФО""
	               |	И ДоговорПриложениеКДоговору.Ссылка.ВидРаботы.Наименование <> ""Акты иностран. магистрант""
	               |	И ДоговорПриложениеКДоговору.Ссылка.ВидРаботы.Наименование <> ""Акты иностран. магистрант ЗФО""
	               |	И ДоговорПриложениеКДоговору.Ссылка.ВидРаботы.Наименование <> ""Акты иностран. студент""
	               |	И ДоговорПриложениеКДоговору.Ссылка.ВидРаботы.Наименование <> ""Акты премия""
	               |	И ДоговорПриложениеКДоговору.Ссылка.ВидРаботы.Наименование <> ""Акты премия иностран. маг.""
	               |	И ДоговорПриложениеКДоговору.Ссылка.ВидРаботы.Наименование <> ""Акты премия иностран. маг. руков.""
	               |	И ДоговорПриложениеКДоговору.Ссылка.ВидРаботы.Наименование <> ""Акты премия иностран. студент""
	               |	И ДоговорПриложениеКДоговору.Ссылка.ДатаС >= ДАТАВРЕМЯ(2022, 2, 1, 0, 0, 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерДоговора";
	ТЗ = Запрос.Выполнить().Выгрузить();
	ЗаписатьТаблицуЗначенийВExcel(ТЗ, Путь);
	Возврат 0;
КонецФункции