&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НаборКонстант.ОтключитьПользователей = Истина И НаборКонстант.ПослатьПредупреждениеОтключения = Ложь Тогда
		Ответ = Вопрос("Вы уверены, что хотите отключить пользователей без оповещения?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НаборКонстант.ПослатьПредупреждениеОтключения = Ложь Тогда
		ЭтаФорма.Элементы.ТекстПредупреждения.Доступность = Ложь;
		ЭтаФорма.Элементы.ТекстПредупрежденияДляНовых.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослатьСообщениеОтключенияПриИзменении(Элемент)
	ЭтаФорма.Элементы.ТекстПредупреждения.Доступность = НаборКонстант.ПослатьПредупреждениеОтключения;
	ЭтаФорма.Элементы.ТекстПредупрежденияДляНовых.Доступность = НаборКонстант.ПослатьПредупреждениеОтключения; 
КонецПроцедуры
