&НаСервере
Процедура ПросклонятьФИОНаСервере()
	Состояние = ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаСклонений", "NameDecl" , ТипВнешнейКомпоненты.Native);
	Если Не Состояние Тогда
		Сообщить("невозможно подключить внешнюю компоненту");
		Возврат;
	КонецЕсли;
	Сколнения = Новый("AddIn.NameDecl.CNameDecl");	
	Выборка = Справочники.СтудентыБГЭУ.Выбрать();	
	Пока Выборка.Следующий() Цикл
		Студент = Выборка.ПолучитьОбъект();
		Студент.Заблокировать();
		Попытка
			Студент.ФИОРод = Сколнения.Просклонять(Студент.Наименование, 2);
			Студент.ФИОДат = Сколнения.Просклонять(Студент.Наименование, 3);
			Студент.ФИОВин = Сколнения.Просклонять(Студент.Наименование, 4);
			Студент.ФИОТвор = Сколнения.Просклонять(Студент.Наименование, 5);
			Студент.ФИОПредл = Сколнения.Просклонять(Студент.Наименование, 6);
		Исключение
			Сообщить("Ошибка при склонении " + Студент.Наименование);
			Продолжить;
		КонецПопытки;	
		Студент.Записать();
		Студент.Разблокировать();
	КонецЦикла;
КонецПроцедуры