
&НаКлиенте
Процедура КоличествоОбъектовПриИзменении(Элемент)	
	Если КоличествоОбъектов = "Один" Тогда
		Элементы.Сотрудник.Видимость = Истина;
		Элементы.СтудентБГЭУ.Видимость = Истина;
		Элементы.УчГруппа.Видимость = Истина;
		Элементы.УчПлан.Видимость = Истина;
	Иначе
		Сотрудник = Неопределено;
	    СтудентБГЭУ = Неопределено;
		УчГруппа = Неопределено;
		УчПлан = Неопределено;
		Элементы.Сотрудник.Видимость = Ложь;
		Элементы.СтудентБГЭУ.Видимость = Ложь;
		Элементы.УчГруппа.Видимость = Ложь;
		Элементы.УчПлан.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбъектВыгрузкиПриСменеСтраницы(Неопределено, Элементы.ОбъектВыгрузки.ТекущаяСтраница);
	КоличествоОбъектов = "Все";
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыгрузкиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	// Устанавливаем новое имя файла.
	// -1 в Лев служит для того, чтобы при пустой строке у нас сформировался путь "\ИмяФайла.xml" (Это корень диска С). 
	НовыйПуть = Лев(ПутьКФайлу, СтрНайти(ПутьКФайлу, "\", НаправлениеПоиска.СКонца) - 1);
	ПутьКФайлу = НовыйПуть + "\" + ТекущаяСтраница.Имя + ".xml";
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	Если  ЗначениеЗаполнено(ПутьКФайлу) Тогда
		ДиалогОткрытияФайла.ПолноеИмяФайла = ПутьКФайлу;
	КонецЕсли;
	Фильтр = "Tекст(*.xml)|*.xml";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл для сохранения";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		Для Каждого ИмяФайла Из МассивФайлов Цикл
			ВыбФайл = Новый Файл(ИмяФайла);
			ПутьКФайлу = ИмяФайла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбъекты(Команда)
	Если ПутьКФайлу = "" Тогда
		Сообщить("Не заполнен путь для загрузки!");
		Возврат;
	КонецЕсли;
	
	ОбъектВыгрузки = Элементы.ОбъектВыгрузки.ТекущаяСтраница.Имя;
	Режим = РежимДиалогаВопрос.ДаНет;
	Текст = "ru = ""Вы точно хотите загрузить " + ОбъектВыгрузки + "?"";";
	Ответ = Вопрос(НСтр(Текст), Режим, 0,, "Вопрос к пользователю");
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	Состояние("Выполняется чтение XML ...",,);
	ЗагрузитьОбъектыСервер(ПутьКФайлу);
	Сообщить(ОбъектВыгрузки + " успешно прочитан");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьОбъектыСервер(Путь) 
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(Путь);
	Читать = Истина;
	ОбъектДокумент = Неопределено;
	Пока Читать Цикл
		Если ВозможностьЧтенияXML(ЧтениеXML) Тогда 		
			Попытка
				ОбъектСпр = ПрочитатьXML(ЧтениеXML);
				ОбъектСпр.Записать();
			Исключение
				Сообщить("" + ОбъектСпр + " не записан!");
			КонецПопытки;	
		Иначе 
			Читать = ЧтениеXML.Прочитать(); 			
		КонецЕсли; 
	КонецЦикла;
	ЧтениеXML.Закрыть(); 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьОбъектыСервер(ОбъектВыгрузки, Ссылка, ПутьКФайлу)
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.Отступ = Истина;
	ЗаписьXML.ОткрытьФайл(ПутьКФайлу);
	ЗаписьXML.ЗаписатьОбъявлениеXML();   	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Body");
	
	Если Ссылка.Пустая() Тогда
		Запрос = Новый Запрос;	
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ " + ОбъектВыгрузки + ".Ссылка ИЗ " + ОбъектВыгрузки;
		ВыборкаДок = Запрос.Выполнить().Выбрать();
		Пока ВыборкаДок.Следующий() Цикл
			СсылкаДок = ВыборкаДок.Ссылка;
			ЗаписатьXML(ЗаписьXML, СсылкаДок.ПолучитьОбъект());
		КонецЦикла;
	Иначе
		ЗаписатьXML(ЗаписьXML, Ссылка.ПолучитьОбъект());	
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.Закрыть(); 
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбъектыСправочников(Команда)
	ОбъектВыгрузки = Элементы.ОбъектВыгрузки.ТекущаяСтраница.Имя;
	Если ПутьКФайлу = "" Тогда
		Сообщить("Не заполнен путь для выгрузки!");
		Возврат;
	КонецЕсли;
	
	Если ОбъектВыгрузки = "Сотрудники" Тогда
		Ссылка = Сотрудник;
	ИначеЕсли ОбъектВыгрузки = "СтудентыБГЭУ" Тогда
		Ссылка = СтудентБГЭУ;
	ИначеЕсли ОбъектВыгрузки = "УчебныеГруппыБГЭУ" Тогда
		Ссылка = УчГруппа;
	КонецЕсли;
	
	Если КоличествоОбъектов = "Один" Тогда
		Если Ссылка.Пустая() Тогда
			Сообщить("Не выбран ни один элемент");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Состояние("Выполняется запись XML ...",,);
	ВыгрузитьОбъектыСервер("Справочник." + ОбъектВыгрузки, Ссылка, ПутьКФайлу);
	Сообщить(ОбъектВыгрузки + " записаны" + Символы.ПС + "в папку"+ Символы.ПС + ПутьКФайлу);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбъектыДокументов(Команда)
	Если ПутьКФайлу = "" Тогда
		Сообщить("Не заполнен путь для выгрузки!");
		Возврат;
	КонецЕсли;
	
	Ссылка = УчПланСпециальности;
	Если КоличествоОбъектов = "Один" Тогда
		Если Ссылка.Пустая() Тогда
			Сообщить("Не выбран ни один документ");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Состояние("Выполняется запись XML ...",,);
	ВыгрузитьОбъектыСервер("Документ.УчебныйПланСпециальности", Ссылка, ПутьКФайлу);
	Сообщить("Учебные планы записаны" + Символы.ПС + "в папку"+ Символы.ПС + ПутьКФайлу);
КонецПроцедуры
