&НаСервере
Функция ПолучитьМассивНедельПоСеместрам()
	ТЗГраф = Объект.График.Выгрузить();
	МассивСеместры = Новый Массив;
	Для Курс = 0 По ТЗГраф.Количество() - 1 Цикл
		КолНедель = 0;											// Общее число недель, которые в графике никак не помечены
		ПоследняяНеделяОсеннегоСеместра = 0;                    // Граница между Осенним и Весенним семестрами
		Для Неделя = 2 По ТЗГраф.Колонки.Количество() - 2 Цикл	// Идём по неделям
			Если ТЗГраф[Курс][Неделя].Наименование = "/" Тогда  // Мы не учитываем часть графика после защиты диплома
				Прервать;	
			КонецЕсли;
			Если ТЗГраф[Курс][Неделя].Наименование = "" Тогда 
				КолНедель = КолНедель + 1;
			ИначеЕсли ПоследняяНеделяОсеннегоСеместра = 0 Тогда
				ПоследняяНеделяОсеннегоСеместра = КолНедель;
			КонецЕсли;
		КонецЦикла;
		МассивСеместры.Добавить(ПоследняяНеделяОсеннегоСеместра);
		Если КолНедель - ПоследняяНеделяОсеннегоСеместра <> 0 Тогда
			МассивСеместры.Добавить(КолНедель - ПоследняяНеделяОсеннегоСеместра);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивСеместры;
КонецФункции

&НаКлиенте
Процедура ПроставитьНедели(Команда)
	МассивСеместры = ПолучитьМассивНедельПоСеместрам();
	Парам = Новый Структура;
	Парам.Вставить("Семестры", МассивСеместры);
	Форма = ПолучитьФорму("ОбщаяФорма.ЧислоНедельВПланСпециальности", Парам, ЭтаФорма, УникальныйИдентификатор);
	Резуьтат = Форма.ОткрытьМодально();
	
	Если ТипЗнч(Резуьтат) = Тип("массив") тогда
		Для Каждого СтрТЧ Из  Объект.Дисциплины Цикл
			Для Сем = 0 По Резуьтат.Количество() - 1 Цикл			// В массиве содержится кол недель по семестрам. При этом Резуьтат[0] - 1 сем, Резуьтат[1] - 2 сем и тд
				Если Строка(СтрТЧ.Сем) = Строка(Сем + 1) Тогда
					СтрТЧ.ЧислоНедель = Резуьтат[Сем];	
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры