&НаСервере
Процедура ТестНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонецУчебногоГода.Значение - УчебныйПланСпециальности.ГодНабора.ГодНабораЧислом КАК Курс,
		|	УчебныйПланСпециальности.УчетныйНомер КАК УчетныйНомер,
		|	УчебныйПланСпециальности.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТекКурс
		|ИЗ
		|	Документ.УчебныйПланСпециальности КАК УчебныйПланСпециальности,
		|	Константа.КонецУчебногоГода КАК КонецУчебногоГода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УчебныйПланСпециальностиДисциплины.Дисциплина КАК Дисциплина,
		|	УчебныйПланСпециальностиДисциплины.Курс КАК Курс,
		|	УчебныйПланСпециальностиДисциплины.Сем КАК Сем,
		|	УчебныйПланСпециальностиДисциплины.Кафедра КАК Кафедра,
		|	УчебныйПланСпециальностиДисциплины.ВсегоАудиторныхДляДФО КАК ВсегоАудиторныхДляДФО,
		|	УчебныйПланСпециальностиДисциплины.КЗ КАК КЗ,
		|	УчебныйПланСпециальностиДисциплины.Ссылка.ФормаОбучения КАК ФормаОбучения,
		|	УчебныйПланСпециальностиДисциплины.Ссылка.ГодНабора КАК ГодНабора,
		|	УчебныйПланСпециальностиДисциплины.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДанныеПланов
		|ИЗ
		|	Документ.УчебныйПланСпециальности.Дисциплины КАК УчебныйПланСпециальностиДисциплины
		|ГДЕ
		|	УчебныйПланСпециальностиДисциплины.КЗ = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПланов.Дисциплина КАК Дисциплина,
		|	ДанныеПланов.Курс КАК Курс,
		|	ДанныеПланов.Кафедра КАК Кафедра,
		|	ДанныеПланов.ВсегоАудиторныхДляДФО КАК ВсегоАудиторныхДляДФО,
		|	ДанныеПланов.КЗ КАК КЗ,
		|	ДанныеПланов.ГодНабора КАК ГодНабора
		|ИЗ
		|	ДанныеПланов КАК ДанныеПланов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекКурс КАК ТекКурс
		|		ПО ДанныеПланов.Курс.КурсЧислом = ТекКурс.курс
		|			И ДанныеПланов.Ссылка = ТекКурс.Ссылка";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Служебный.ВывестиТаблицуЗначенияВКодеВТаблицуНаФорме(ЭтаФорма,ТЗ);
КонецПроцедуры